initials = [
    "b",
    "c",
    "ch",
    "d",
    "f",
    "g",
    "h",
    "j",
    "k",
    "l",
    "m",
    "n",
    "p",
    "q",
    "r",
    "s",
    "sh",
    "t",
    "w",
    "x",
    "y",
    "z",
    "zh",
]
finals = [
    "a1",
    "a2",
    "a3",
    "a4",
    "a5",
    "ai1",
    "ai2",
    "ai3",
    "ai4",
    "ai5",
    "an1",
    "an2",
    "an3",
    "an4",
    "an5",
    "ang1",
    "ang2",
    "ang3",
    "ang4",
    "ang5",
    "ao1",
    "ao2",
    "ao3",
    "ao4",
    "ao5",
    "e1",
    "e2",
    "e3",
    "e4",
    "e5",
    "ei1",
    "ei2",
    "ei3",
    "ei4",
    "ei5",
    "en1",
    "en2",
    "en3",
    "en4",
    "en5",
    "eng1",
    "eng2",
    "eng3",
    "eng4",
    "eng5",
    "er1",
    "er2",
    "er3",
    "er4",
    "er5",
    "i1",
    "i2",
    "i3",
    "i4",
    "i5",
    "ia1",
    "ia2",
    "ia3",
    "ia4",
    "ia5",
    "ian1",
    "ian2",
    "ian3",
    "ian4",
    "ian5",
    "iang1",
    "iang2",
    "iang3",
    "iang4",
    "iang5",
    "iao1",
    "iao2",
    "iao3",
    "iao4",
    "iao5",
    "ie1",
    "ie2",
    "ie3",
    "ie4",
    "ie5",
    "ii1",
    "ii2",
    "ii3",
    "ii4",
    "ii5",
    "iii1",
    "iii2",
    "iii3",
    "iii4",
    "iii5",
    "in1",
    "in2",
    "in3",
    "in4",
    "in5",
    "ing1",
    "ing2",
    "ing3",
    "ing4",
    "ing5",
    "iong1",
    "iong2",
    "iong3",
    "iong4",
    "iong5",
    "iou1",
    "iou2",
    "iou3",
    "iou4",
    "iou5",
    "o1",
    "o2",
    "o3",
    "o4",
    "o5",
    "ong1",
    "ong2",
    "ong3",
    "ong4",
    "ong5",
    "ou1",
    "ou2",
    "ou3",
    "ou4",
    "ou5",
    "u1",
    "u2",
    "u3",
    "u4",
    "u5",
    "ua1",
    "ua2",
    "ua3",
    "ua4",
    "ua5",
    "uai1",
    "uai2",
    "uai3",
    "uai4",
    "uai5",
    "uan1",
    "uan2",
    "uan3",
    "uan4",
    "uan5",
    "uang1",
    "uang2",
    "uang3",
    "uang4",
    "uang5",
    "uei1",
    "uei2",
    "uei3",
    "uei4",
    "uei5",
    "uen1",
    "uen2",
    "uen3",
    "uen4",
    "uen5",
    "uo1",
    "uo2",
    "uo3",
    "uo4",
    "uo5",
    "v1",
    "v2",
    "v3",
    "v4",
    "v5",
    "van1",
    "van2",
    "van3",
    "van4",
    "van5",
    "ve1",
    "ve2",
    "ve3",
    "ve4",
    "ve5",
    "vn1",
    "vn2",
    "vn3",
    "vn4",
    "vn5",
]

### this is from ipa dataset
## https://github.com/AdamSteffanick/ipa-data/blob/master/guid-o-matic/ipa-data/ipa-data.csv
part_1 =  ['p', 'b', 't', 'd', 'ʈ', 'ɖ', 'c', 'ɟ', 'k', 'ɡ', 'q', 'ɢ', 'ʔ', 'm', 'ɱ']
part_2 =  ['n', 'ɳ', 'ɲ', 'ŋ', 'ɴ', 'ʙ', 'r', 'ʀ', 'ɾ', 'ɽ', 'ɸ', 'β', 'f', 'v', 'θ']
part_3 =  ['ð', 's', 'z', 'ʃ', 'ʒ', 'ʂ', 'ʐ', 'ç', 'ʝ', 'x', 'ɣ', 'χ', 'ʁ', 'ħ', 'ʕ']
part_4 =  ['h', 'ɦ', 'ɬ', 'ɮ', 'ʋ', 'ɹ', 'ɻ', 'j', 'ɰ', 'l', 'ɭ', 'ʎ', 'ʟ', 'ƥ', 'ɓ']
part_5 =  ['ƭ', 'ɗ', 'ƈ', 'ʄ', 'ƙ', 'ɠ', 'ʠ', 'ʛ', 'ʍ', 'w', 'ɥ', 'ʜ', 'ʡ', 'ʢ', 'ɧ']
part_6 =  ['ʘ', 'ǀ', 'ǃ', 'ǂ', 'ǁ', 'ɺ', 'ɕ', 'ʑ', 'ⱱ', 'ʇ', 'ʗ', 'ʖ', 'ʆ', 'ʓ', 'ɼ']
part_7 =  ['ˢ', 'ƫ', 'ɫ', 'g', 'ʦ', 'ʣ', 'ʧ', 'ʤ', 'ʨ', 'ʥ', 'ᶿ', 'ᵊ', 'ᶑ', 'ȶ', 'ȡ']
part_8 =  ['ȵ', 'ƻ', 'ʞ', 'ˣ', 'ƞ', 'ƛ', 'λ', 'ž', 'š', 'ǰ', 'č', 'i', 'e', 'ɛ', 'a']
part_9 =  ['ɑ', 'ɔ', 'o', 'u', 'y', 'ø', 'œ', 'ɶ', 'ɒ', 'ʌ', 'ɤ', 'ɯ', 'ɨ', 'ʉ', 'ɪ']
part_10 =  ['ʏ', 'ʊ', 'ə', 'ɵ', 'ɐ', 'æ', 'ɜ', 'ɚ', 'ı', 'ɞ', 'ʚ', 'ɘ', 'ɷ', 'ɩ', 'ʼ']
part_11 =  ['̥;̊', '̬', 'ʰ', '̤', '̰', '̼', '̪', '̺', '̻', '̹', '̜', '̟', '̠', '̈', '̽']
part_12 =  ['̘', '̙', '˞', 'ʷ', 'ʲ', 'ˠ', 'ˤ', '̃', 'ⁿ', 'ˡ', '̚', '̴', '̝;˔', '̞;˕', '̩']
part_13 =  ['̯', '͡', '̢', '˹', ',', 'ʻ', '̇', '˗', '˖', 'ʸ', '̣', '̡', '̫', 'ˈ', 'ˌ']
part_14 =  ['ː', 'ˑ', '̆', '.', '|', '‖', '‿', '↗', '↘', '̋', '́', '̄', '̀', '̏', '↓']

part_15 =  ['↑', '˥', '˦', '˧', '˨', '˩', '̌', '̂',] ## 뒤에 3개 
part_16 =  ['˩˥', '˥˩', '˦˥', '˩˨', '˧˦˧', '̑', 'ˇ', 'ˆ', '̖;ˎ', '̗;ˏ', 'ʭ', 'ʩ', 'ʪ', 'ʫ', '❍', '*', ]

part_17 =  ['(.)', '(..)', '(...)',] ## 뒤에 여섯개 
part_18 =  ['͆', '͍', '̪͆', '͊', '͋', '͌', '͈', '͉', '\\', '͎', '↓', '↑', 'ˬ']
part_19 =  ['ˬ', '₍̬₎', '₍̬', '̬₎', '₍̥₎', '₍̥', '̥₎', 'ʰ', '!!', 'ᶹ', '͢', '͇', 'ʶ', 'ꟸ', 'ꟹ']
part_20 =  ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', 'C', 'L', 'J', 'Œ', 'Θ', '1', '2', '3', 'V', 'F', 'W']
part_21 =  ['!', '˭', '˱', '˲', '˷', '[', ']', '/', '(', ')', '((', '))', '{', '}']

part_22 = [  '᷄', '᷅', '᷈', '𝆑', '𝆑𝆑', '𝆏', '𝆏𝆏', '𝑎𝑙𝑙𝑒𝑔𝑟𝑜', '𝑙𝑒𝑛𝑡𝑜',] ## 인식 불가

ipa_total_symbols = list( set( part_1 + part_2 + part_3 + part_4 + part_5 + part_6 + part_7 +  part_8 + part_9 + part_10) )
ipa_total_symbols = ipa_total_symbols + list( set( part_11 + part_12 + part_13 + part_14 + part_15 + part_16 + part_17 +  part_18 + part_19 + part_20 + part_21 ) )
ipa_total_symbols = list(set(ipa_total_symbols ))
ipa_totals = ["@" + s for s in ipa_total_symbols]

### This is from spvocab.vocab (prof)
### phones whose phsone[0] == "_" are too many (6584) -> Temporary exclueded
part__1 =  ['ʊ', '̹', 'ú', '˨', 'ɟ', '̪', '̆', 'ă', 'F', '*', 'ɱ', '.', '%', 'ẽ', 'é']
part__2 =  ['e', 's', '̞', 'C', '4', '͜', 'ː', 'ç', 'ʈ', 'f', 'ǐ', '͡', 'ĩ', 'ɑ', '"']
part__3 =  ['ɹ', '̊', 'i', 'ð', 'っ', '3', 'ɦ', '˕', 'ʐ', '5', '̰', 'Õ', '̚', 'ɐ', 'd']
part__4 =  ['ɓ', 'ɲ', '̨', 'ʌ', 'è', 'ɻ', 'ɒ', 'X', 'ĭ', 'ó', 'a', 'y', 'ŏ', 'N', 'ɝ']
part__5 =  ['̌', 'x', 'ɯ', 'ɽ', 'ʋ', '̩', 'j', '́', 'í', 'ɵ', 'ʃ', '`', 'ɣ', '̃', '̻']
part__6 =  ['ʒ', 'ɳ', 'ˌ', 'ɸ', '9', 'l', 'ħ', 'ô', '0', 'ɾ', 'ə', 'ʧ', '˔', 'ʼ', '͈']
part__7 =  ['̠', '̺', 'ɪ', '̍', '˥', 'χ', 'ʕ', '̝', 'θ', 'ɗ', 'I', 'ĕ', 'c', 'p', 'ɚ']
part__8 =  ['U', 'ɬ', '̥', 'æ', 'w', 'k', 'β', '1', '˾', 'ê', 'ʑ', 'ʦ', 'b', 'ɜ', '−']
part__9 =  ['ʔ', 'r', '}', '-', 'ɥ', '^', 'A', 'ッ', "'", 'ŋ', 'ɴ', 'ǎ', 'ʏ', 'E', 'ʂ']
part__10 =  ['ʀ', 'o', 'q', 'ɫ', 'u', 'ũ', '̂', 'ˈ', 'S', 'ʎ', 'v', 'ʝ', 'ʁ', 'ɠ', 'à']
part__11 =  [':', 'g', 'ě', 'â', '˩', 'n', 'á', '˦', '̟', 'ɡ', 'ɭ', '̯', 'ɨ', 'Y', 'ɖ']
part__12 =  ['õ', 'ɤ', 'O', 'ɛ', 't', 'h', '2', 'ò', 'T', 'R', 'ɰ', 'ɕ', 'ã', 'D', 'm']
part__13 =  ['˧', '̀', 'ø', 'ɘ', 'ʄ', 'ˑ', 'œ', 'ʉ', 'ɔ', 'ˀ', 'î', 'z', 'ä']


filtered_ones = list(set(part__1 + part__2 + part__3 + part__4 + part__5 + part__6 + part__13 + part__7 + part__8 + part__9 + part__10 + part__11 + part__12 ))
filters = ["@" + s for s in filtered_ones ]
# print(len(filtered_ones))
# filtered_ones[:10]

## This is GERMAN
## New: from TextGrids by MFA
part1 = ['@ɔ', '@tʰ', '@ɐ', '@t', '@iː', '@ə', '@ŋ', '@v', '@l̩', '@ç', '@x', '@ʊ', '@ɔʏ']
part2 = ['@uː', '@aj', '@ʏ', '@ɟ', '@yː', '@pf', '@l', '@h', '@f', '@ʁ', '@k', '@ɛ', '@ɪ', '@ʃ']
part3 = ['@aw', '@aː', '@œ', '@eː', '@ts', '@tʃ', '@oː', '@kʰ', '@z', '@j', '@s', '@pʰ', '@ɲ', '@cʰ']
part4 = ['@a', '@n̩', '@øː', '@c', '@n', '@d', '@p', '@b', '@m', '@m̩', '@ɡ']

## manually added
part5 = [ '@l̥', '@œ̃', '@a̠', '@aɪ', '@it', '@eː', '@in', 'ˈu', '@ɤ̆', '@aŋ', '@t͡', '@ŋ͡', '@oː', '@˦˨', '@ˈi', '@əɫ', '@o̞', '@ˈo', '@ɐ̃', '@aː', '@n̪', '@ɛ̝', '@i̯' ]
part6 = [ '@t̪', '@l̪', '@w̃', '@d̪', '@j̃', '@ˈe', '@ʃt', '@az', '@ɔs', '@ɔɫ', '@ɔɕ', '@ɾt', '@iˈ', '@kw', '@ɐm', '@ɪg', '@͡p']
part7 = [ '@ẽː', '@ɛː', '@ɜː', '@ˈɛ', '@t̪', '@l̪', '@w̃', '@d̪', '@ap', '@jo', '@j̃', '@ˈs', '@k̚']

ger_totals = list( set( part1 + part2 + part3 + part4 + part5 + part6 + part7) )
# ger_total_phones = ["@" + s for s in ger_total_phones ]


## This is English
en_part_1 =  ['ɛ', 'aj', 'mʲ', 'n', 'ɜː', 'vʷ', 'tʲ', 'dʲ', 'ɾ̃', 'ɒː', 'fʲ', 'ɔj']
en_part_2 =  ['cʷ', 'k', 'ɛː', 'ɟ', 'ow', 'h', 'ʎ', 'iː', 'ɔ', 'pʷ', 'ɐ', 'tʃ']
en_part_3 =  ['ɝ', 'ɡʷ', 'ʃ', 'm', 'ʉː', 'ç', 'bʲ', 'vʲ', 't̪', 'm̩', 'ej'] # 'spn',
en_part_4 =  ['e', 'i', 'ʒ', 't', 'ð', 'ʔ', 'f', 'ɹ', 'ɪ', 'd̪', 'aw', 'ɾ']
en_part_5 =  ['kʷ', 'p', 'ɲ', 'd', 'ɾʲ', 'tʷ', 'b', 'c', 'ɟʷ', 'uː', 'aː', 'w']
en_part_6 =  ['ɫ̩', 'pʰ', 'pʲ', 'l', 'a', 'o', 'əw', 'kʰ', 'ʉ', 'z', 'ŋ', 'ʊ']
en_part_7 =  ['ɡ', 'cʰ', 'ə', 'θ', 'æ', 'u', 'n̩', 'ɑː', 's', 'ɫ', 'ɑ', 'j']
en_part_8 =  ['dʒ', 'tʰ', 'v', 'ɚ', 'ɒ', 'ɜ']

en_total_phones = list(set(en_part_1 + en_part_2 + en_part_3 + en_part_4 + en_part_5 + en_part_6 + en_part_7 + en_part_8 ))
en_totals = ["@" + s for s in en_total_phones ]
# len(en_total_phones) ## 90

## This is French
fr_part_1 =  ['ø', 'œ', 'c', 'ɑ̃', 'mʲ', 'ʃ', 'b', 'ɲ', 'u', 'n']
fr_part_2 =  ['l', 'tʃ', 's', 'a', 'ɛ', 'j', 'ʁ', 'o', 't', 'ɟ']
fr_part_3 =  ['dʒ', 'ʒ', 'p', 'k', 'ʎ', 'ɛ̃', 'w', 'ɔ', 'z'] # 'spn']
fr_part_4 =  ['ɡ', 'ɥ', 'y', 'i', 'v', 'ɔ̃', 'm', 'e', 'ə', 'ɑ']
fr_part_5 =  ['d', 'ts', 'f', 'ŋ']

fr_total_phones = list(set(fr_part_1 + fr_part_2 + fr_part_3 + fr_part_4 + fr_part_5 ))
fr_totals = ["@" + s for s in fr_total_phones ]
# len(fr_total_phones) ## 44

## This is Polish
pol_part_1 =  ['k', 's̪', 'l', 't̪', 'tʂ', 'ʐ', 'p', 'u', 'ɟ', 'ɛ̃', 'd̪z̪']
pol_part_2 =  ['tɕ', 'pʲ', 'ŋ', 'x', 'z̪', 'ʑ', 'tʲ', 'rʲ', 'i', 'w', 'mʲ']
pol_part_3 =  ['ɔ̃', 'dʐ', 'ʂ', 'm', 'v', 'ɨ', 'ɲ', 'ʎ', 'bʲ', 'dʑ', 'a']
pol_part_4 =  ['fʲ', 'b', 'j̃', 'n̪', 'ɛ', 'f', 'ʔ', 't̪s̪', 'ɔ', 'j', 'd̪']
pol_part_5 =  ['c', 'ç', 'ɕ', 'ɡ', 'vʲ', 'r'] # 'spn',

pol_total_phones = list(set(pol_part_1 + pol_part_2 + pol_part_3 + pol_part_4 + pol_part_5 ) )
pol_totals = ["@" + s for s in pol_total_phones ]
# len(pol_total_phones) ## 51

## This is Portuguese
port_part_1 =  ['ɐ̃', 'z', 'x', 'a', 'ɟ', 'ʁ', 'ɡ', 't', 'ʎ', 's', 'ʃ'] # 'spn',
port_part_2 =  ['β', 'u', 'tʃ', 'p', 'i', 'w', 'j', 'ɣ', 'õ', 'j̃', 'v', 'w̃']
port_part_3 =  ['ɛ', 'n', 'd', 'k', 'l', 'b', 'ĩ', 'dʒ', 'm', 'ɔ', 'ɨ', 'e']
port_part_4 =  ['ʒ', 'c', 'o', 'ũ', 'f', 'ɾ', 'ð', 'ẽ', 'ɲ', 'ɐ']

port_total_phones = list(set(port_part_1 + port_part_2 + port_part_3 + port_part_4 ) )
port_totals = ["@" + s for s in port_total_phones ]
# len(port_total_phones) ## 46

## This is Spanish
spa_part_1 =  ['ŋ', 'j', 'a', 'p', 'e', 'b', 'w', 'β', 'ɟ', 'ɟʝ', 'ɾ', 'l']
spa_part_2 =  ['m', 'f', 'r', 'd̪', 'k', 's', 'x', 'ɡ', 'o', 'ð', 'ʝ', 'i']
spa_part_3 =  ['θ', 'ɲ', 'u', 'tʃ', 'ɣ', 'ʎ', 'ç', 'n', 'ʃ', 't̪', 'c'] # 'spn', 

spa_total_phones = list(set(spa_part_1 + spa_part_2 + spa_part_3 ) )
spa_totals = ["@" + s for s in spa_total_phones ]
# len(spa_total_phones) ## 36


valid_symbols = initials + finals + ["rr"]

valid_symbols2 = list( set(ipa_totals + filters + ger_totals) )
