[UNK]	0
[CLS]	0
[EOS]	0
▁ˈ	-0
▁d	-1
▁k	-2
ˈa	-3
▁t	-4
ɾɯ	-5
ɯɾɯ	-6
▁p	-7
ɸɯɾɯ	-8
▁s	-9
▁m	-10
ən	-11
˧˧	-12
an	-13
▁b	-14
▁l	-15
st	-16
eɪ	-17
▁a	-18
ˈi	-19
▁j	-20
nt	-21
˨ˀ	-22
˨ˀ˩	-23
▁n	-24
▁ˈð	-25
nd	-26
at	-27
a̠	-28
aɪ	-29
it	-30
eː	-31
in	-32
▁h	-33
▁ˈt	-34
˨ˀ˩ʔ	-35
▁e	-36
ˈu	-37
ˈɛ	-38
as	-39
ak	-40
▁v	-41
▁ˈɪ	-42
▁f	-43
˩˨	-44
▁ˈðɛ	-45
iː	-46
˧˩˨	-47
▁ˈw	-48
▁de	-49
▁ˈæ	-50
al	-51
▁ˈʔ	-52
əˈ	-53
▁i	-54
˧˨	-55
t͡	-56
oʊ	-57
on	-58
aɾ	-59
en	-60
▁ˈf	-61
ʌ̹	-62
▁ˈh	-63
▁ˈm	-64
▁ˈk	-65
▁ˈs	-66
ik	-67
d͡	-68
ɔɹ	-69
ər	-70
ɪŋ	-71
▁ˈb	-72
əm	-73
am	-74
˦˥	-75
iə	-76
os	-77
ɤ̆	-78
aŋ	-79
▁ˌ	-80
ŋ͡	-81
ŋ͡m	-82
oː	-83
ˈe	-84
ju	-85
▁ˈp	-86
▁ˈd	-87
˦˨	-88
▁ɛ	-89
əɫ	-90
▁t͡	-91
im	-92
is	-93
▁ˈtu	-94
˨˦	-95
ɑ̃	-96
˩˧	-97
o̞	-98
▁z	-99
ət	-100
eɾ	-101
es	-102
▁la	-103
ts	-104
▁th	-105
ɪn	-106
▁ˈə	-107
ar	-108
▁ˈɡ	-109
ok	-110
un	-111
ɔ̃	-112
▁ˈɛ	-113
aj	-114
om	-115
ɐ̯	-116
ˈan	-117
▁ˈn	-118
▁ˈeɪ	-119
oɯ	-120
ɑː	-121
aʊ	-122
▁w	-123
▁ˈɫ	-124
ah	-125
ɪˈ	-126
▁ɲ	-127
▁r	-128
oɾ	-129
ˈar	-130
ˈaŋ	-131
d͡ʒ	-132
äː	-133
▁c	-134
jɛ	-135
si	-136
ɕi	-137
ta	-138
kt	-139
▁ɡ	-140
▁o	-141
▁ˈəf	-142
ɯə	-143
te	-144
▁ˈv	-145
ˈo	-146
ad	-147
id	-148
ŋ˧˧	-149
ɐ̃	-150
kan	-151
aː	-152
sj	-153
ɛl	-154
ɛt	-155
▁ˈɪn	-156
ti	-157
ɪk	-158
▁d͡	-159
▁ʂ	-160
aw	-161
ɔr	-162
▁x	-163
▁ʈ	-164
ʃən	-165
əs	-166
ɹi	-167
▁di	-168
▁ˈju	-169
ɪs	-170
ka	-171
tu	-172
e̞	-173
ɲa	-174
əl	-175
to	-176
ɛn	-177
d͡ʑ	-178
ɪt	-179
ˈal	-180
ɪd	-181
ɡa	-182
ˈeː	-183
iz	-184
us	-185
ɛʁ	-186
k˦˥	-187
ɔn	-188
er	-189
mp	-190
▁d͡ʒ	-191
▁ku	-192
t͡ʃ	-193
▁əˈ	-194
n̪	-195
▁ʔ	-196
ɛ̝	-197
uk	-198
ɪç	-199
uː	-200
▁ˈaɪ	-201
oŋ͡m	-202
▁ɔ	-203
ɛɾ	-204
▁kɔ	-205
il	-206
ɕh	-207
▁ˈwɪ	-208
ɛs	-209
▁də	-210
▁ˈɪs	-211
▁sə	-212
ɾa	-213
▁ke	-214
æt	-215
ɯn	-216
˧ˀ	-217
˧ˀ˥	-218
ɑn	-219
ˈam	-220
▁ˈʔa	-221
▁ˈʃ	-222
ks	-223
da	-224
▁ʁ	-225
a˧˧	-226
▁kə	-227
▁ŋ	-228
▁tˈi	-229
ha̠	-230
ni	-231
▁ˈɹ	-232
ɛnt	-233
de	-234
ənt	-235
ut	-236
sa	-237
ol	-238
ent	-239
͡p	-240
oj	-241
ɫi	-242
ɔv	-243
ji	-244
▁t͡ʃ	-245
la	-246
▁g	-247
æn	-248
əŋ	-249
ɑɹ	-250
▁un	-251
▁se	-252
ɾe	-253
ja	-254
jʌ̹	-255
ˈɛr	-256
▁ˈʔʊ	-257
ɛk	-258
iəŋ	-259
▁da	-260
ɛst	-261
wa	-262
▁dˈi	-263
um	-264
▁dɨ	-265
ɛm	-266
ɾi	-267
t̪	-268
l̪	-269
w̃	-270
ɐ̃w̃	-271
d̪	-272
▁pr	-273
ɛː	-274
ˈaː	-275
▁t͡ɕ	-276
▁ˈj	-277
ap	-278
jo	-279
j̃	-280
að	-281
▁ˈɪt	-282
▁pɔ	-283
a̠n	-284
▁ˈst	-285
sjon	-286
▁pɾ	-287
▁al	-288
▁pu	-289
sh	-290
dʒ	-291
eɪt	-292
▁bər	-293
ma	-294
ˈat	-295
▁u	-296
͡ɪ	-297
ˌe	-298
ɛɫ	-299
ai	-300
əb	-301
ɤj	-302
▁in	-303
ki	-304
ˈt	-305
ɕit	-306
ak˦˥	-307
di	-308
▁ʒ	-309
▁le	-310
ɪst	-311
le	-312
▁ʐ	-313
ɔŋ͡m	-314
ot	-315
ɛr	-316
sp	-317
▁na	-318
▁su	-319
▁diː	-320
▁paɾ	-321
iv	-322
▁ˈaʊ	-323
▁mən	-324
t͡ɕ	-325
▁vu	-326
▁ˈu	-327
▁dˈe	-328
ɾɐ	-329
▁ˈɔ	-330
ʃt	-331
na	-332
se	-333
▁ˈɡi	-334
ip	-335
eːn	-336
joɯ	-337
ku	-338
ɑt	-339
͡ʊ	-340
ăj	-341
ɪz	-342
▁ˈɑn	-343
ɯk	-344
ɔl	-345
▁en	-346
eɪv	-347
▁tər	-348
ini	-349
▁ˈɛɹ	-350
ɝz	-351
▁ˈbi	-352
ɛɹ	-353
▁el	-354
ˈap	-355
ɤ̆ŋ	-356
▁pa	-357
ŋɡ	-358
et	-359
aɪ̯	-360
at͡	-361
ˈah	-362
▁kw	-363
ɹɑ	-364
▁du	-365
▁kon	-366
▁ɹ	-367
▁dɔ	-368
no	-369
▁dˌ	-370
▁ja	-371
▁məm	-372
or	-373
▁ˈθ	-374
ʊŋ	-375
ŋan	-376
ɛj	-377
əˌ	-378
ɛnd	-379
▁kom	-380
ɯŋ	-381
eɴ	-382
du	-383
əst	-384
ɔz	-385
ẽj̃	-386
▁dɛʁ	-387
ɡi	-388
▁dˈɛ	-389
ɯm	-390
▁st	-391
▁ɑ̃	-392
el	-393
▁sh	-394
ək	-395
i˧˧	-396
ata	-397
▁sˈa	-398
ˈet	-399
op	-400
ˈɪ	-401
ra	-402
ˈoː	-403
▁ʃ	-404
em	-405
▁kõ	-406
ið	-407
ɛd	-408
▁ju	-409
▁s̪	-410
akɯ	-411
▁il	-412
ˈak	-413
of	-414
iəw	-415
▁dɪˈ	-416
ɛ̃	-417
ga	-418
ok͡p	-419
▁məŋ	-420
ɯɭ	-421
ɪɹ	-422
▁si	-423
ʂɨ	-424
ˈp	-425
it͡	-426
ʊd	-427
aɾɯ	-428
ɲɛ	-429
ba	-430
aɪt	-431
ɾ̪	-432
ɪɫ	-433
▁ˈdʒ	-434
▁tu	-435
and	-436
suː	-437
▁ko	-438
sk	-439
ˈm	-440
▁ɕ	-441
▁ˌɪn	-442
ˈari	-443
ft	-444
vɝ	-445
ʌ̹n	-446
▁lə	-447
▁kɛ	-448
ŋk	-449
aŋ˧˧	-450
ɔt	-451
▁ˈz	-452
▁mu	-453
ˈasi	-454
▁ˈwi	-455
iɾ	-456
▁ki	-457
bi	-458
ˈiː	-459
k̚	-460
jɔ̃	-461
▁ˈɔɹ	-462
▁ka	-463
ɪm	-464
ɯəŋ	-465
▁bəˈ	-466
ɛkt	-467
nt͡	-468
yː	-469
▁pər	-470
in˧˧	-471
ɪv	-472
ɔɾ	-473
sɯ	-474
ato	-475
ɔk	-476
ul	-477
ənd	-478
asɯ	-479
▁gəˈ	-480
ɤ̆j	-481
ɔ˧˧	-482
▁ɦ	-483
ɯɾ	-484
▁kuə	-485
ntuk	-486
▁ˈæz	-487
a̠ŋ	-488
▁bˈa	-489
ɔʁ	-490
▁ɪn	-491
ɐs	-492
dən	-493
▁ma	-494
oto	-495
ˈs	-496
▁an	-497
je	-498
ɛp	-499
ɤ̆w	-500
▁pʁ	-501
ˈk	-502
t͡ʂ	-503
ɰβ	-504
▁ˈtʃ	-505
bl	-506
▁t̪	-507
▁sp	-508
ˈara	-509
we	-510
▁me	-511
▁ɣ	-512
ɛɡ	-513
ˌt	-514
ɔm	-515
up	-516
nd͡	-517
k˨ˀ˩	-518
▁n̪	-519
▁ɹɪˈ	-520
▁nu	-521
▁ap	-522
ha	-523
▁ˈan	-524
ud	-525
iŋ	-526
tʃ	-527
▁ˈɔɫ	-528
▁pl	-529
▁ˈɛs	-530
ek	-531
sta	-532
▁ˈen	-533
▁sɛ	-534
▁pɹ	-535
ɰi	-536
t͡s	-537
ito	-538
eɪk	-539
ˈv	-540
▁the	-541
iːt	-542
▁ˈtɹ	-543
▁mˈa	-544
dʑ	-545
ika	-546
in˦˨	-547
▁baŋ	-548
əp	-549
▁ˈl	-550
ɦa̠	-551
▁ˈak	-552
yʁ	-553
mən	-554
œ̃	-555
▁as	-556
ɪnt	-557
ˈɛl	-558
▁ũ	-559
▁kən	-560
ðɝ	-561
▁ˈg	-562
▁ʋ	-563
▁pˈa	-564
▁ˈæn	-565
▁ˈpɹ	-566
ur	-567
dak	-568
ˈur	-569
nə	-570
▁los	-571
▁dɛl	-572
itu	-573
▁una	-574
ɪ̯	-575
əɾ	-576
▁ad	-577
tsɯ	-578
aːs	-579
▁ɛl	-580
eɪn	-581
▁ˈwɝ	-582
ăŋ˧˧	-583
▁ˈpɫ	-584
wa̠	-585
▁bɪˈ	-586
lɪç	-587
ez	-588
ib	-589
▁kɔ̃	-590
ax	-591
▁ˈæt	-592
ke	-593
▁ˈhw	-594
ˈɔr	-595
ɑɫ	-596
ɪdʒ	-597
æk	-598
ɛːɐ̯	-599
ʌɪ̯	-600
mi	-601
ʌ̹ŋ	-602
en˧˧	-603
ˈia	-604
▁ɹi	-605
▁kəm	-606
ia	-607
▁ˈoʊ	-608
▁bˈi	-609
aɪd	-610
ha̠ɭ	-611
ɯəj	-612
p˨ˀ˩	-613
▁vɨ	-614
▁nɔ	-615
eːs	-616
ɫd	-617
▁lˈa	-618
▁y	-619
▁per	-620
ɪçt	-621
▁mɔ	-622
▁av	-623
▁puʁ	-624
ˈul	-625
ə̃	-626
tɨ	-627
▁kl	-628
ima	-629
っte	-630
bˈa	-631
▁te	-632
əd	-633
▁dɯə	-634
▁ˈhæ	-635
ɹɑm	-636
▁ɲɛ	-637
ɡo̞	-638
▁to	-639
ono	-640
ite	-641
ˈuː	-642
ø̞	-643
ɕhi	-644
ada	-645
▁œ̃	-646
▁ˈɡɹ	-647
p˦˥	-648
ant	-649
nɨ	-650
▁jɤj	-651
uʃ	-652
▁tɯ	-653
ana	-654
œʁ	-655
əns	-656
ente	-657
▁ˈa	-658
ăŋ	-659
ɡə	-660
▁ˈɪf	-661
uv	-662
k͈	-663
▁no	-664
ita	-665
ɑp	-666
ɐʃ	-667
mɑ̃	-668
aʊt	-669
tə	-670
ri	-671
aɪm	-672
ˈf	-673
eɪd	-674
pl	-675
oɴ	-676
ʃənz	-677
▁re	-678
tən	-679
mb	-680
w˧˧	-681
▁ɪˈ	-682
əti	-683
▁es	-684
▁tˈɛ	-685
nən	-686
ʊk	-687
ɤ̆m	-688
iək	-689
çi	-690
ˈaːr	-691
͡ɪn	-692
ɛv	-693
uŋ	-694
əɫi	-695
▁ɕɛ	-696
▁ɾ	-697
▁ɛst	-698
ɪʃ	-699
ɔp	-700
▁zɛt	-701
▁ɐ	-702
ˈama	-703
me	-704
mənt	-705
▁bi	-706
jon	-707
ɪp	-708
▁ˈal	-709
▁ĩ	-710
okɯ	-711
ɥi	-712
ˈas	-713
▁ˈdu	-714
▁poɾ	-715
▁del	-716
oz	-717
ɑɹt	-718
▁at	-719
▁paʁ	-720
ɝd	-721
oʊz	-722
eɪs	-723
aka	-724
ɡa̠	-725
▁d̪	-726
▁aw	-727
ˈaɲa	-728
uɾ	-729
▁ˈkɫ	-730
ăj˧˧	-731
ˈɛs	-732
ph	-733
▁əˈb	-734
əɡ	-735
ina	-736
▁sa	-737
ɪɡ	-738
əiːt	-739
ˈz	-740
ida̠	-741
▁ɲɤ̆	-742
o̞ŋ	-743
▁las	-744
▁ph	-745
əbəɫ	-746
uk͡p	-747
aɪk	-748
▁est	-749
iːl	-750
▁a̠	-751
ɑz	-752
ist	-753
▁ˈhi	-754
ˌw	-755
od	-756
ɔø	-757
ˈian	-758
▁ˈsp	-759
aɪn	-760
uŋ͡m	-761
▁ɪst	-762
▁ziː	-763
th	-764
uf	-765
s̪	-766
ɯɯ	-767
bˈu	-768
ɛɡɔ	-769
▁ʂɯ	-770
tʁ	-771
▁mə	-772
shʌ̹	-773
re	-774
are	-775
ʊɹ	-776
▁yn	-777
ene	-778
esɯ	-779
▁mi	-780
ʂɛ	-781
tɾ	-782
▁mər	-783
▁peɾ	-784
də	-785
̃ː	-786
ä̃ː	-787
mu	-788
▁ɪk	-789
▁ɲɯŋ	-790
ˈil	-791
aɪz	-792
▁je	-793
az	-794
ẽː	-795
jʌ̹n	-796
ɔs	-797
▁ɛ̃	-798
ɕite	-799
▁ti	-800
ɤ˧˩˨	-801
ˈita	-802
▁hw	-803
ăj˧˨	-804
ˈadi	-805
a̠m	-806
▁mˌ	-807
▁tr	-808
ɔɹt	-809
t͡ɕh	-810
▁ɲɯ	-811
▁sˈu	-812
▁tɐ	-813
ɛ˧˩˨	-814
ɦa̠n	-815
ɪtʃ	-816
▁d͡ʑ	-817
aɾe	-818
ɾɯɭ	-819
ɔɫ	-820
▁ˈɹi	-821
ajs	-822
▁it	-823
ɛɹi	-824
aːɡə	-825
eɪz	-826
ɔɕ	-827
▁sˈɛ	-828
ˈaan	-829
▁os	-830
▁ˈəp	-831
▁iʃ	-832
ɾt	-833
iˈ	-834
kw	-835
ɛːɐ	-836
▁viː	-837
▁səˈ	-838
ɐm	-839
ɪg	-840
mo	-841
äːɾ	-842
▁kˌ	-843
▁dy	-844
if	-845
aw˧˧	-846
d͡ʑi	-847
ɑ̃s	-848
fɝ	-849
ij	-850
oːn	-851
▁tw	-852
▁mɛ	-853
ɔb	-854
▁mˈu	-855
nd͡ʑ	-856
aŋ˧˨	-857
▁int	-858
▁taj	-859
▁ʁe	-860
oʊst	-861
eɪm	-862
ænd	-863
bən	-864
iβ	-865
jʌ̹ŋ	-866
▁ẽj̃	-867
an˦˨	-868
ɝˌ	-869
d͡z	-870
aɪnd	-871
▁dis	-872
ˈts	-873
mpan	-874
sən	-875
eɪɫ	-876
▁dən	-877
ko	-878
ɔd	-879
ɑnt	-880
▁ˈɾ	-881
ˈn	-882
▁məl	-883
▁tʁ	-884
▁lo	-885
va	-886
ɔk͡p	-887
▁mɪt	-888
it͡ʃ	-889
ano	-890
nɯn	-891
ˈə	-892
ɦɛ̝	-893
pa	-894
sɨ	-895
ʌɾ̪	-896
▁kˈa	-897
att͡	-898
▁ˈti	-899
ˌk	-900
aŋ˦˨	-901
yːɐ̯	-902
▁ẽ	-903
əh	-904
▁kar	-905
▁ˈbɹ	-906
▁sˈi	-907
▁bl	-908
a˧˨	-909
sja	-910
əv	-911
ɪʃən	-912
waj	-913
iɾɯ	-914
t͈	-915
▁keː	-916
▁dɑ̃	-917
▁tɔ	-918
oj˧˧	-919
ˌd	-920
ɕoɯ	-921
a̠ɭ	-922
ðo	-923
ɔŋ	-924
▁lˈɛ	-925
ɪnd	-926
ˈd	-927
ow	-928
iðað	-929
ɛll	-930
▁tˈe	-931
ˈit	-932
iəs	-933
▁pəm	-934
ɕita	-935
▁ˈsɝ	-936
t̚	-937
▁bˈu	-938
ɛb	-939
ˈom	-940
av	-941
æm	-942
ɛɾn	-943
p̚	-944
in˩˧	-945
jɐ	-946
ɝn	-947
d͡ʒa	-948
ov	-949
ækt	-950
kɯ	-951
▁səl	-952
æɫ	-953
ətʃ	-954
▁bˌ	-955
▁sɔ̃	-956
ʊɾ	-957
bɯ	-958
ɔraŋ	-959
▁ʒə	-960
▁pas	-961
ˈua	-962
▁kɯ	-963
▁syʁ	-964
▁t͡s	-965
hat	-966
ind	-967
n̪eː	-968
▁ˈmi	-969
▁ˈop	-970
▁ˈnu	-971
▁səm	-972
nɛ	-973
▁ak	-974
▁ˈkw	-975
aɾa	-976
▁l̪	-977
ento	-978
▁ˈæɫ	-979
ntu	-980
▁seɾ	-981
ir	-982
o˧˧	-983
▁ci	-984
ɔnt͡	-985
sha̠	-986
iːm	-987
ed	-988
ăk˦˥	-989
ej	-990
omo	-991
m˧˧	-992
ˈol	-993
ɔst	-994
▁pəŋ	-995
ff	-996
aɾi	-997
ɾo	-998
ɡɹ	-999
ama	-1000
ɨm	-1001
n̪d̪	-1002
ɸɯ	-1003
ˈami	-1004
i͡	-1005
ˌf	-1006
ˌs	-1007
ˈuɡa	-1008
▁lam	-1009
bu	-1010
əˈn	-1011
ˈɑː	-1012
ɛz	-1013
▁ɛs	-1014
t͡ɕ͈	-1015
ˈik	-1016
ɡu	-1017
ps	-1018
at͡ɕ	-1019
ːʌ	-1020
ẽtu	-1021
but	-1022
ɪkəɫ	-1023
ˈum	-1024
ɾu	-1025
ale	-1026
oki	-1027
▁kam	-1028
dah	-1029
ei	-1030
ɪŋk	-1031
so	-1032
ɐj	-1033
ˈi͡	-1034
jɛ̃	-1035
▁eːs	-1036
çito	-1037
ɤ̆k	-1038
han	-1039
ab	-1040
▁ˈkɹ	-1041
iːɾ	-1042
ˈst	-1043
t͡ɕi	-1044
ðu	-1045
ɡa͡ɪ	-1046
っt	-1047
▁pʂ	-1048
̯x	-1049
ˈɾ	-1050
▁ˈhu	-1051
▁li	-1052
eʁ	-1053
ˈl	-1054
iko	-1055
æst	-1056
ɔva	-1057
▁ˈfɹ	-1058
▁ˈsi	-1059
soʊ	-1060
itʃ	-1061
▁sək	-1062
ˈɛn	-1063
▁das	-1064
kai	-1065
ˈsp	-1066
▁zɪç	-1067
ˈana	-1068
ɔj	-1069
pən	-1070
ɔɡ	-1071
ʐɨ	-1072
▁man	-1073
da̠	-1074
ɛŋ	-1075
aɴ	-1076
ʒi	-1077
əˈɫ	-1078
oʊɫ	-1079
▁mas	-1080
koto	-1081
ʌɭ	-1082
▁laj	-1083
eːk	-1084
pɾ	-1085
▁ˈpɝ	-1086
▁hɤ	-1087
aɪ̯n	-1088
ˈin	-1089
▁pɾo	-1090
aj˧˧	-1091
aʁ	-1092
lu	-1093
▁pˈu	-1094
▁sw	-1095
aðo	-1096
ando	-1097
n̪ɐ	-1098
▁pən	-1099
zi	-1100
ˈer	-1101
ʐɛ	-1102
▁vˌ	-1103
ɐɾ	-1104
▁ũɐ	-1105
▁sɨ	-1106
aɪɫ	-1107
maɾɯ	-1108
all	-1109
ˈɛna	-1110
▁thu	-1111
ɪl	-1112
əz	-1113
ˈika	-1114
oɾi	-1115
tɕi	-1116
ʌm	-1117
ɤj˧˨	-1118
wiəŋ	-1119
ɨx	-1120
▁ji	-1121
eːm	-1122
ɛf	-1123
ɛç	-1124
▁ˈsk	-1125
ɛʃ	-1126
▁puɾ	-1127
aŋ˩˧	-1128
ɝˈ	-1129
▁bo	-1130
am˧˧	-1131
▁kʌ̹	-1132
ˈati	-1133
▁ka̠	-1134
oːd	-1135
▁fu	-1136
▁am	-1137
i˧˨	-1138
oʊt	-1139
ɨʃ	-1140
gəˈ	-1141
▁kiː	-1142
ˈpɫ	-1143
aɡ	-1144
ˈasa	-1145
ˈon	-1146
▁ˈts	-1147
ăw˧˧	-1148
▁den	-1149
ere	-1150
jə	-1151
▁məɲ	-1152
▁ɪç	-1153
▁ply	-1154
˧˥	-1155
bil	-1156
sjɔ̃	-1157
əɫz	-1158
jen	-1159
ɑːn	-1160
▁po	-1161
ɛ˧˧	-1162
▁tɾ	-1163
əˈm	-1164
▁jak	-1165
oko	-1166
ˈel	-1167
▁ar	-1168
ˈoːɾ	-1169
ˈb	-1170
ɯɾo̞	-1171
ɪkt	-1172
ɯk˦˥	-1173
▁jaw	-1174
ˈuk	-1175
nd͡ʒ	-1176
ɑk	-1177
▁sk	-1178
ˌz	-1179
tur	-1180
▁ˈɔf	-1181
ɛks	-1182
ɡən	-1183
▁hɪs	-1184
zah	-1185
ɑ̃d	-1186
▁ˈʃt	-1187
ʊnd	-1188
▁lu	-1189
ndʒ	-1190
▁səp	-1191
ɡe̞	-1192
ˈis	-1193
waʁ	-1194
aʊn	-1195
bɐ	-1196
ðe	-1197
oʊn	-1198
▁mo	-1199
θɪŋ	-1200
aːn	-1201
ete	-1202
▁əˈp	-1203
͡ɪk	-1204
at˦˥	-1205
▁kh	-1206
ˈada	-1207
oːk	-1208
su	-1209
sɯɾɯ	-1210
▁vjɛ	-1211
itɕi	-1212
ˌɫ	-1213
▁ʌ̹	-1214
oːɐ̯	-1215
geɴ	-1216
▁ɡr	-1217
ˈa͡ɪ	-1218
ˈapa	-1219
jit͡	-1220
gən	-1221
ɑm	-1222
▁sˌ	-1223
desɯ	-1224
ˈiŋ	-1225
ˌb	-1226
ɪŋz	-1227
aɪv	-1228
keː	-1229
▁ˈɛv	-1230
mɐ	-1231
ɑ̃t	-1232
eç	-1233
ino	-1234
ɕiɴ	-1235
kji	-1236
▁ˈbɫ	-1237
əɦ	-1238
ʃu	-1239
ʎʎ	-1240
ipəɫ	-1241
▁ow	-1242
ːɯ	-1243
ɛnt͡	-1244
do	-1245
ə̃n̪	-1246
iɡ	-1247
▁ˈdɹ	-1248
jos	-1249
ˈali	-1250
ɕik	-1251
▁ɸ	-1252
bih	-1253
ɔf	-1254
əˈt	-1255
oʊɪŋ	-1256
▁haː	-1257
▁do	-1258
o̞n	-1259
ənz	-1260
▁ʔɨ	-1261
ɲi	-1262
▁ɔt	-1263
eːɐ̯	-1264
▁im	-1265
▁bɦ	-1266
nəs	-1267
ˈuan	-1268
akt	-1269
ɛns	-1270
▁ɦɛː	-1271
ante	-1272
ate	-1273
yːb	-1274
jun	-1275
▁kəp	-1276
▁äː	-1277
▁pʂɨ	-1278
do̞	-1279
▁mẽː	-1280
▁shu	-1281
ɐ̃du	-1282
nik	-1283
ɛmp	-1284
▁baw	-1285
▁ˈɔn	-1286
til	-1287
▁ɛn	-1288
õː	-1289
▁hɝ	-1290
▁ən	-1291
ɰβa	-1292
omi	-1293
▁nɔn	-1294
▁nə	-1295
ˈir	-1296
eɾa	-1297
str	-1298
iɫ	-1299
jal	-1300
▁ˈfɝ	-1301
ˌm	-1302
▁ma̠	-1303
nt͡ʃ	-1304
əf	-1305
ˈɛm	-1306
ˈapi	-1307
ɔɹm	-1308
▁ˈol	-1309
ˈɫ	-1310
▁kɔm	-1311
ɪti	-1312
kə	-1313
▁nɯə	-1314
ɔɹd	-1315
ne	-1316
lt	-1317
an˧˧	-1318
t͡ʃi	-1319
ɤj˨˦	-1320
▁doj	-1321
▁ta	-1322
kɔ	-1323
ɛɲ	-1324
▁ha̠	-1325
▁so	-1326
▁ɑː	-1327
pt	-1328
ˈɛka	-1329
ih	-1330
▁tut	-1331
▁ʐɛ	-1332
est	-1333
▁ˈʃi	-1334
▁ek	-1335
aɾim	-1336
▁faj	-1337
ɪf	-1338
ˈant	-1339
▁noj	-1340
als	-1341
ann	-1342
zən	-1343
▁ç	-1344
ɾiː	-1345
ðað	-1346
go	-1347
▁ˈvɪ	-1348
▁pɾe	-1349
lˈi	-1350
▁ˈθɹ	-1351
art	-1352
ˈus	-1353
õj̃	-1354
itsɯ	-1355
d̪ɦ	-1356
æs	-1357
ˈaja	-1358
ʊm	-1359
ɲak	-1360
at͡ʃ	-1361
ˈiːt	-1362
ˈala	-1363
ɤ˧˧	-1364
əj	-1365
▁za	-1366
▁cu	-1367
ət̪	-1368
ˈut	-1369
be	-1370
▁t͡ʂ	-1371
ˈand	-1372
ʌd̪	-1373
uh	-1374
▁nɛ	-1375
ɔrm	-1376
oʊm	-1377
atsɯ	-1378
▁ʎ	-1379
ʌ̹ɭ	-1380
iɾe	-1381
aɪs	-1382
za	-1383
▁it̚	-1384
▁wa	-1385
▁mat	-1386
▁wi	-1387
▁koː	-1388
mpat	-1389
▁ɔ̃	-1390
nta	-1391
t̪h	-1392
iɴ	-1393
lo	-1394
▁kr	-1395
ɹˈaː	-1396
bɯɴ	-1397
olo	-1398
bəɫ	-1399
pe	-1400
aʊnd	-1401
uɡ	-1402
ɑɹk	-1403
▁tiə	-1404
▁tak	-1405
▁ˌɪm	-1406
nok	-1407
ʁi	-1408
bat	-1409
▁t͈	-1410
iəm	-1411
vi	-1412
sˈɛ	-1413
▁ʁɨ	-1414
▁pə	-1415
▁kˈu	-1416
ərˈi	-1417
ˈok	-1418
ɔnt	-1419
ɯtsɯ	-1420
ʁɛ	-1421
ˈeɪt	-1422
ʌ̹m	-1423
fəɫ	-1424
▁imp	-1425
▁tˈu	-1426
ˈsi	-1427
ɑɾ	-1428
ali	-1429
ɾas	-1430
▁hˌ	-1431
pi	-1432
kh	-1433
ʌl̪	-1434
ɨl̪	-1435
ˌθɪŋ	-1436
wi	-1437
dɨ	-1438
ɑs	-1439
ʁe	-1440
▁mă	-1441
ˈen	-1442
n̩	-1443
▁tɛ̝	-1444
øː	-1445
▁kj	-1446
bo̞	-1447
▁sət	-1448
ˈot	-1449
▁ab	-1450
▁aj	-1451
ɨj	-1452
ˈos	-1453
▁kal	-1454
ve	-1455
▁kəl	-1456
ɾes	-1457
man	-1458
dʑi	-1459
ʊŋən	-1460
ndo	-1461
bɝ	-1462
▁tɾa	-1463
ro	-1464
ˈʃ	-1465
ˈiɲa	-1466
▁ˌk	-1467
▁ˈəs	-1468
hoɯ	-1469
▁kət	-1470
dɐ	-1471
▁ˈiv	-1472
lik	-1473
aɪɝ	-1474
▁dan	-1475
▁kan	-1476
sji	-1477
ˈoɡ	-1478
wɔ	-1479
ose	-1480
dʑoɯ	-1481
oɾa	-1482
ða	-1483
ɾo̞	-1484
oʊk	-1485
ish	-1486
ɪks	-1487
nɨx	-1488
alt	-1489
▁esp	-1490
ˈata	-1491
▁pɛʁ	-1492
æd	-1493
aw˧˨	-1494
vɛɾ	-1495
▁pˌ	-1496
▁po̞	-1497
ɛts	-1498
aɾt	-1499
ɐn	-1500
▁be	-1501
pu	-1502
ʌn	-1503
aða	-1504
ɔɹs	-1505
▁ʂaŋ	-1506
kj	-1507
akˈu	-1508
ɛɫp	-1509
po	-1510
əmz	-1511
əˈv	-1512
▁ˈi	-1513
ɕim	-1514
son	-1515
▁bɨ	-1516
▁din	-1517
xt	-1518
lɛ	-1519
uʁ	-1520
ɛkst	-1521
▁ˈkæ	-1522
aki	-1523
wan	-1524
ɑɹd	-1525
ɛlt	-1526
▁ˈpɾ	-1527
▁sɛt	-1528
dai	-1529
▁kol	-1530
▁ho	-1531
▁ta̠	-1532
▁ˈbɑ	-1533
t͡ɕɛ	-1534
▁sal	-1535
ˈh	-1536
▁res	-1537
adʑ	-1538
▁ˈfɫ	-1539
▁vi	-1540
ge	-1541
mɨ	-1542
ˈeːl	-1543
▁ɔp	-1544
keɪ	-1545
▁ɕh	-1546
n̪äː	-1547
adu	-1548
ʌʋ	-1549
ati	-1550
bj	-1551
▁mo̞	-1552
▁nɛl	-1553
▁kəɾ	-1554
ːɾ	-1555
▁ɔr	-1556
tam	-1557
ɔtʁ	-1558
ɪɫd	-1559
▁jɯə	-1560
əl̪	-1561
stɹ	-1562
otɕi	-1563
▁aɾ	-1564
ˌʃ	-1565
ɡw	-1566
▁tˌ	-1567
▁ˈap	-1568
ˈeːr	-1569
jin	-1570
tɐ	-1571
▁təl	-1572
mas	-1573
lji	-1574
li	-1575
s͈	-1576
aɪf	-1577
fik	-1578
iðo	-1579
t̪ː	-1580
ẽtɨ	-1581
it˦˥	-1582
▁ˈeː	-1583
ɨn	-1584
▁ne	-1585
▁ʈi	-1586
uːɾ	-1587
əw	-1588
ɾa̠	-1589
▁pwe	-1590
ilˈi	-1591
ɛni	-1592
æns	-1593
ăŋ˩˧	-1594
dʒi	-1595
ăŋ˧˨	-1596
▁nat	-1597
▁dez	-1598
ʃəɫ	-1599
ja̠	-1600
yl	-1601
ɑd	-1602
ales	-1603
ɪɹi	-1604
ĭoːn	-1605
▁kˈo	-1606
▁str	-1607
▁əˈɫ	-1608
▁nwe	-1609
▁ˈom	-1610
▁ˈkɑ	-1611
kən	-1612
ɪ̃	-1613
amo	-1614
▁cɤ̆	-1615
▁bɔ	-1616
j˨˦	-1617
ɐ̃j̃	-1618
▁ŋiə	-1619
t͡ʂɨ	-1620
ɯmn	-1621
▁mũ	-1622
ɪs̪	-1623
heː	-1624
joŋ	-1625
▁wˈa	-1626
▁baj	-1627
ɔɪ	-1628
ənts	-1629
ɕɯɯ	-1630
nˌt	-1631
ast	-1632
▁op	-1633
▁foɾ	-1634
▁səb	-1635
fj	-1636
▁iʃt	-1637
▁kap	-1638
ˈoor	-1639
▁ˈæs	-1640
▁on	-1641
nis	-1642
amp	-1643
kaɾ	-1644
ˈalu	-1645
ˈa͡ʊ	-1646
pɝ	-1647
ɲu	-1648
▁ˈɛn	-1649
tse	-1650
oʊɫd	-1651
ɝi	-1652
▁ˈɛɫ	-1653
▁daj	-1654
ena	-1655
oɾe	-1656
d͡ʑɛ	-1657
▁ˈjɛ	-1658
bə	-1659
ˈɛt	-1660
▁fin	-1661
ʁa	-1662
▁əˈk	-1663
ˈisi	-1664
iːɐ̯	-1665
▁akt	-1666
aj˨˦	-1667
ɾɑː	-1668
tiv	-1669
βa	-1670
je̞	-1671
▁əˈm	-1672
pr	-1673
ftɝ	-1674
▁ˈof	-1675
▁kəs	-1676
ˈaru	-1677
̪ɐ	-1678
ɫoʊ	-1679
▁pɔt	-1680
▁pa̠	-1681
sei	-1682
eːɾɐ	-1683
sɛ	-1684
▁pe	-1685
min	-1686
mono	-1687
aʊnt	-1688
u˧˧	-1689
aːl	-1690
fɔ	-1691
ˈmeɪ	-1692
▁nas	-1693
koɯ	-1694
ns	-1695
əɫɝ	-1696
▁fo	-1697
ɛ̝ŋ	-1698
▁zoː	-1699
jɛj	-1700
▁par	-1701
ɨv	-1702
ˈad	-1703
▁kɤ̆	-1704
▁ɕhi	-1705
ˌɛr	-1706
▁sit	-1707
ɝˈa	-1708
eɪdʒ	-1709
ɑl	-1710
ikɐ	-1711
▁jaj	-1712
▁pɝ	-1713
ˈkɫ	-1714
ɛɫf	-1715
gjoɯ	-1716
ˌp	-1717
oːɡ	-1718
əŋ˩˧	-1719
ˈʔ	-1720
▁bu	-1721
ev	-1722
▁fi	-1723
▁mak	-1724
▁aβ	-1725
br	-1726
ɪts	-1727
nde	-1728
▁us	-1729
▁ko̞	-1730
a͡ɪ	-1731
jɛr	-1732
ɐt̪	-1733
juz	-1734
hak	-1735
its	-1736
lə	-1737
ɑːm	-1738
▁ˈgɾ	-1739
▁toð	-1740
▁biə	-1741
wiə	-1742
iki	-1743
▁duʃ	-1744
▁hoj	-1745
kl	-1746
iːf	-1747
k̚k͈	-1748
jɛʁ	-1749
▁ent	-1750
itt͡	-1751
▁ʊ	-1752
əkt	-1753
ˈw	-1754
▁ɪɡ	-1755
adʒi	-1756
stə	-1757
▁ˌɹ	-1758
imo	-1759
oʊd	-1760
ɣo	-1761
ɕa	-1762
▁ele	-1763
ɑːɾ̪	-1764
▁käː	-1765
▁tɤ̆	-1766
▁br	-1767
ɤj˧˧	-1768
▁gʁ	-1769
unˈa	-1770
jas	-1771
ɕima	-1772
▁sus	-1773
jäː	-1774
ɑːɾ	-1775
▁ben	-1776
ˈiri	-1777
ˈɾa	-1778
▁ˈæd	-1779
sɐ	-1780
▁vɛn	-1781
teɾ	-1782
ɔnd	-1783
▁ʐɤ̆	-1784
ɪɹz	-1785
▁ˈɛm	-1786
ʃi	-1787
ˈod	-1788
oh	-1789
ɐ̯ə	-1790
onəs	-1791
eses	-1792
aːbɐ	-1793
əˌɫ	-1794
mato	-1795
▁ˈkœ	-1796
▁cɯə	-1797
iːjə	-1798
gə	-1799
ˈeɪ	-1800
▁jʌ̹	-1801
▁pø	-1802
fɔrm	-1803
▁ʔa	-1804
▁son	-1805
▁tɛ	-1806
▁hwa	-1807
βwa̠	-1808
ɲit͡	-1809
ɡr	-1810
o˩˧	-1811
ants	-1812
ɕo	-1813
ɐɾɐ	-1814
▁af	-1815
ˈɛnt	-1816
▁um	-1817
ɔvjɛ	-1818
oɾes	-1819
ɯŋ˨˦	-1820
ðɨ	-1821
βe	-1822
▁ɸw	-1823
ɪmm	-1824
▁sew	-1825
▁id	-1826
əˈd	-1827
ɾɐ̃	-1828
ks͈	-1829
▁ˈsm	-1830
▁et	-1831
tai	-1832
iku	-1833
ɪgən	-1834
ekt	-1835
nɔɕ	-1836
ɑb	-1837
õj̃ʃ	-1838
ˈun	-1839
▁dɛ	-1840
▁ˈik	-1841
▁ˈθæ	-1842
əndɝ	-1843
ʈː	-1844
ɛsp	-1845
ŋ˩˧	-1846
aliz	-1847
▁əˈɡ	-1848
at͡s	-1849
▁lw	-1850
ɔx	-1851
▁pəɲ	-1852
▁jɛ	-1853
uɭ	-1854
gakɯ	-1855
▁ɛʁ	-1856
ʒən	-1857
iːn	-1858
ˌɛl	-1859
ons	-1860
ətɪv	-1861
fis	-1862
pat	-1863
kɐ	-1864
▁ind	-1865
▁mɔ̃	-1866
rav	-1867
amji	-1868
ɛ̃ː	-1869
jis	-1870
▁bən	-1871
doɯ	-1872
ɨɾ̪	-1873
mə	-1874
pɔɹt	-1875
ont	-1876
ɔɾt	-1877
atɕi	-1878
▁ʝ	-1879
saɴ	-1880
▁ɔb	-1881
fɔɹ	-1882
enən	-1883
ʃe	-1884
▁xw	-1885
ust	-1886
kɔz	-1887
ʌ̹ɡ	-1888
ɪɾ	-1889
ʊt	-1890
▁səs	-1891
▁sin	-1892
ɛvɝ	-1893
taɾ	-1894
▁sɑ̃	-1895
▁tɯŋ	-1896
tha̠	-1897
▁a̠n	-1898
ˈɛk	-1899
shɯ	-1900
▁tɹ	-1901
uz	-1902
iːd	-1903
ˈui	-1904
▁nax	-1905
▁sɔ	-1906
ˈəl	-1907
▁sup	-1908
▁dˌi	-1909
▁maj	-1910
ˌɛ	-1911
ɔno	-1912
zə	-1913
▁pəl	-1914
ɯɾi	-1915
ɕ͈	-1916
tus	-1917
əvɝ	-1918
n̪iː	-1919
▁fɛʁ	-1920
ɹe	-1921
das	-1922
▁eks	-1923
ese	-1924
uj	-1925
ăj˨˦	-1926
vɛɫ	-1927
▁maɾ	-1928
▁ˈʃp	-1929
ɪns	-1930
▁əˈt	-1931
ˈpɹ	-1932
nɨm	-1933
ətiz	-1934
▁nɔx	-1935
▁ˈʊm	-1936
af	-1937
ɡwa̠	-1938
sas	-1939
ton	-1940
▁pos	-1941
▁fɛ	-1942
ˈab	-1943
jent	-1944
ɡɔ	-1945
▁lˈi	-1946
nda̠	-1947
▁fʁ	-1948
pun	-1949
▁kaɾ	-1950
▁dal	-1951
mun	-1952
ze	-1953
▁thɯ	-1954
äːl̪	-1955
▁fam	-1956
▁pəɾ	-1957
▁fˌ	-1958
ɪtəɫ	-1959
ʃɝ	-1960
gad	-1961
▁jɯ	-1962
pər	-1963
ɛɾt	-1964
▁ɐ̃	-1965
▁bar	-1966
▁jɤ̆	-1967
▁he	-1968
▁tˌe	-1969
▁aʁ	-1970
▁kas	-1971
t̪äː	-1972
▁ɔːɾ	-1973
ɛðɝ	-1974
▁wˈɪ	-1975
əˈz	-1976
əmp	-1977
aˈ	-1978
ăm˧˧	-1979
ɛdʒ	-1980
▁bˌe	-1981
stən	-1982
ʌ̹p̚	-1983
▁əˈd	-1984
▁ˈæm	-1985
ʒe	-1986
lah	-1987
▁nɔv	-1988
ɹɑb	-1989
▁jɛd	-1990
keɴ	-1991
ˈamu	-1992
amos	-1993
▁tim	-1994
ct	-1995
▁pɔd	-1996
eɪst	-1997
▁dă	-1998
ʌɖ	-1999
ˌv	-2000
ɳɖ	-2001
ʊs	-2002
æp	-2003
▁bˈɪ	-2004
əˈb	-2005
▁fas	-2006
zd	-2007
▁dɛj	-2008
kha̠	-2009
hana	-2010
aseɴ	-2011
▁tɨ	-2012
ɲik	-2013
aks	-2014
d͡ʒi	-2015
ɪmp	-2016
ʃtɐ	-2017
wat	-2018
int	-2019
p͈	-2020
ɭɭ	-2021
əˌn	-2022
t͈a̠	-2023
ĩː	-2024
st͡	-2025
▁ɔd	-2026
▁aɪˈ	-2027
▁ba	-2028
ɤŋ˧˧	-2029
▁lˈu	-2030
ɨɾ	-2031
ine	-2032
pɐ	-2033
ɑːl̪	-2034
ɲo	-2035
ativ	-2036
ikas	-2037
▁sẽ	-2038
nak	-2039
eɾɯ	-2040
kəm	-2041
jaw	-2042
gak	-2043
feɾ	-2044
▁taw	-2045
ɾan	-2046
ɯno	-2047
▁pɔl	-2048
uɫ	-2049
ˌh	-2050
utʃ	-2051
▁bəb	-2052
ˈə͡ʊ	-2053
ˈɛri	-2054
inɯn	-2055
▁pju	-2056
aːɐ̯	-2057
▁hɛ̝	-2058
ɛm˧˧	-2059
▁sos	-2060
jan	-2061
dˈe	-2062
ɲɐ	-2063
ɔɹi	-2064
ɨs	-2065
ktu	-2066
ɾae	-2067
o̞k̚	-2068
jʃ	-2069
zɐ	-2070
vɛnt	-2071
▁vid	-2072
▁naj	-2073
aŋk	-2074
ɣu	-2075
ʊx	-2076
ˈɹ	-2077
▁ot	-2078
▁ɛks	-2079
ɛtɝ	-2080
uk̚	-2081
▁lɔ	-2082
ɪl̪	-2083
▁kɹi	-2084
t̪eː	-2085
▁zv	-2086
tʃi	-2087
ɝˈeɪ	-2088
oʊp	-2089
nɔ	-2090
▁ʈɯə	-2091
ami	-2092
▁ɝˈa	-2093
əts	-2094
▁bə	-2095
ˈaːt	-2096
▁prɔ	-2097
▁pʁɔ	-2098
eːb	-2099
ens	-2100
▁bəl	-2101
▁sol	-2102
ɔɪnt	-2103
t͡sa	-2104
nos	-2105
wʌ̹n	-2106
alis	-2107
kaɴ	-2108
oʊnt	-2109
ˈg	-2110
t͡ʂɛ	-2111
ntɹ	-2112
atu	-2113
▁bw	-2114
▁ˈfɾ	-2115
▁ʁez	-2116
▁sul	-2117
βle	-2118
▁ˈiz	-2119
ɡar	-2120
▁mal	-2121
daŋ	-2122
▁ˈo	-2123
ˈatu	-2124
▁dr	-2125
▁thw	-2126
▁na̠	-2127
stɾ	-2128
ɑˈts	-2129
ɔvan	-2130
ɛpt	-2131
nɛj	-2132
▁ˌin	-2133
▁des	-2134
la͡ɪ	-2135
ntaŋ	-2136
ɪt̪	-2137
▁kɔl	-2138
ɑɫə	-2139
ʊn	-2140
ub	-2141
eno	-2142
˨˩	-2143
ərs	-2144
▁o̞	-2145
▁dla	-2146
▁oɾ	-2147
▁lɛs	-2148
▁ˌd	-2149
vɪs	-2150
ænt	-2151
ɨk	-2152
ə̃m	-2153
▁ok	-2154
▁sy	-2155
▁dˌe	-2156
tik	-2157
ɹən	-2158
▁ˈat	-2159
ik̚	-2160
ˌɡɹ	-2161
ˈɾi	-2162
▁iʃp	-2163
nin	-2164
ap˦˥	-2165
ane	-2166
ʌ̹b	-2167
▁foj	-2168
ɔvɛ	-2169
ˈɛrn	-2170
oːm	-2171
βo	-2172
▁liə	-2173
amb	-2174
mɯ	-2175
eːl̪	-2176
▁min	-2177
▁ni	-2178
▁ˈas	-2179
▁teɾ	-2180
nˌz	-2181
ɨt͡ʂ	-2182
ɰβaz	-2183
eɪts	-2184
▁sɔb	-2185
jeɾ	-2186
ɛɾs	-2187
ɛŋ˧˧	-2188
zu	-2189
aʒ	-2190
əˈs	-2191
nim	-2192
▁ɡˌ	-2193
xe	-2194
▁dw	-2195
anˌd	-2196
ado	-2197
ɑːd̪	-2198
▁rˌ	-2199
▁pes	-2200
əˌf	-2201
pɹ	-2202
▁tø̞	-2203
ʌɪ̯j	-2204
ə˧˧	-2205
▁rɔ	-2206
kʌɭ	-2207
ɯke	-2208
ˈoːk	-2209
t͡ʃa	-2210
▁əˈw	-2211
ɪgə	-2212
iða	-2213
ɡan	-2214
▁ɖ	-2215
fɛ	-2216
ˈɑ	-2217
ɑɹdʒ	-2218
nɛɡɔ	-2219
˨˩˦	-2220
▁sɛʁ	-2221
▁fl	-2222
っta	-2223
▁pw	-2224
ɹˈə	-2225
oka	-2226
eneɾ	-2227
ˌn	-2228
ɾjoɯ	-2229
ɐ̯ən	-2230
fa	-2231
kˌ	-2232
eːən	-2233
▁ant	-2234
jɯɯ	-2235
ăm	-2236
fɛkt	-2237
æf	-2238
▁ˌs	-2239
βeɾ	-2240
▁səh	-2241
ɦa̠m	-2242
iːən	-2243
▁ˈɑɹ	-2244
ˈaːl	-2245
▁ew	-2246
əni	-2247
ans	-2248
▁ɛtʁ	-2249
▁t̪h	-2250
ɔ˧˩˨	-2251
iɭ	-2252
▁iɾ	-2253
t˦˥	-2254
▁ʦ	-2255
ike	-2256
enɐ̯	-2257
ɯni	-2258
▁ə	-2259
hoɴ	-2260
ɪpt	-2261
ore	-2262
wal	-2263
it̚	-2264
ɛw	-2265
et˦˥	-2266
▁alɛ	-2267
i̯	-2268
iɯ	-2269
ɯmi	-2270
▁thi	-2271
▁tɛk	-2272
ˌwən	-2273
▁fa	-2274
ˈtɹ	-2275
▁kɛl	-2276
▁ɡɹ	-2277
gɯ	-2278
▁em	-2279
bar	-2280
ɕokɯ	-2281
isip	-2282
▁hɔ	-2283
ˌʃt	-2284
enəm	-2285
kjoɯ	-2286
▁kaw	-2287
u˨˦	-2288
▁pel	-2289
pan	-2290
saɾe	-2291
▁hˈe	-2292
ste	-2293
fi	-2294
alɛ	-2295
adʑi	-2296
eki	-2297
kr	-2298
iːɾt	-2299
▁lɤ	-2300
suːm	-2301
eːʀ	-2302
toɯ	-2303
eːd	-2304
▁duː	-2305
▁men	-2306
▁alt	-2307
▁pj	-2308
▁tan	-2309
ɑns	-2310
d͡ʒu	-2311
ˈuh	-2312
▁ˈbæ	-2313
▁bˈ	-2314
▁viz	-2315
ome	-2316
ɑːɾɐ	-2317
ẽsj	-2318
ɾai	-2319
▁jit	-2320
ɪˈn	-2321
▁ˈæk	-2322
upˈa	-2323
▁ase	-2324
ˈeːɐ	-2325
ers	-2326
▁kɯɾ	-2327
gat	-2328
▁fɔʁ	-2329
joɾ	-2330
▁mɛm	-2331
əˌt	-2332
▁kaʁ	-2333
aðos	-2334
noɯ	-2335
▁ˈdi	-2336
əmɑ̃	-2337
▁măk	-2338
ter	-2339
ob	-2340
jaɾ	-2341
ˌg	-2342
jiz	-2343
▁ˈɑp	-2344
▁pˌe	-2345
▁vo	-2346
ʊɫ	-2347
▁suɐ	-2348
▁ˈva	-2349
▁mar	-2350
▁sɔl	-2351
əbɫ	-2352
ja̠ŋ	-2353
ˈmɪt	-2354
▁ts	-2355
▁zap	-2356
k͈e̞	-2357
kup	-2358
▁ˈia	-2359
▁om	-2360
iə˧˧	-2361
▁ima	-2362
uw	-2363
▁kat	-2364
ːen	-2365
▁div	-2366
▁əˈs	-2367
ad͡ʒ	-2368
sai	-2369
eɪvɝ	-2370
▁əb	-2371
▁ɦoː	-2372
ɹəɫ	-2373
▁ʔen	-2374
jʌ̹ɭ	-2375
▁ˌap	-2376
aɪ̯t	-2377
▁aˈ	-2378
▁ʔan	-2379
oɕi	-2380
æʃən	-2381
▁lœʁ	-2382
▁va	-2383
▁nˌ	-2384
əs̪	-2385
▁kɔn	-2386
əsɪz	-2387
one	-2388
jɔn	-2389
▁tɐ̃	-2390
ith	-2391
ˈstɹ	-2392
tʃɝ	-2393
ˈdeɪ	-2394
zo	-2395
ʊnt	-2396
ɛnte	-2397
oj˧˨	-2398
oːp	-2399
▁ˈvi	-2400
eɪks	-2401
gi	-2402
ɰβat	-2403
jəɫɝ	-2404
▁nos	-2405
▁dim	-2406
ˈuːn	-2407
βɾe	-2408
ide	-2409
ʊkɪŋ	-2410
bɦ	-2411
emos	-2412
vjɛ	-2413
aɪɪŋ	-2414
▁hˈi	-2415
▁sta	-2416
eɾo	-2417
▁nɔ̃	-2418
▁rˈɛ	-2419
mat	-2420
gas	-2421
ɛnti	-2422
▁i˨˦	-2423
uð	-2424
▁fɔ	-2425
jakɯ	-2426
ˈɪn	-2427
æb	-2428
▁ut	-2429
▁mˈo	-2430
ɛsto	-2431
▁ˌm	-2432
t͡sɛ	-2433
foɾ	-2434
▁to̞	-2435
oni	-2436
eb	-2437
ˌst	-2438
əɫt	-2439
aɪts	-2440
has	-2441
▁kõt	-2442
▁ŋe	-2443
ha̠ŋ	-2444
unt	-2445
oɡ	-2446
æks	-2447
tɛʁ	-2448
nɛt	-2449
sip	-2450
ˈamp	-2451
ɾɯn	-2452
des	-2453
ˈaːn	-2454
▁lit	-2455
ɫz	-2456
ɛɫθ	-2457
toɕi	-2458
▁tɑ̃	-2459
dø̞	-2460
awa	-2461
iks	-2462
bˈaŋ	-2463
▁pʂɛ	-2464
ˈuɲa	-2465
sə	-2466
ɹˈeː	-2467
ɛŋk	-2468
▁fr	-2469
ɑnd	-2470
ɕhin	-2471
▁beɾ	-2472
▁ˈɝ	-2473
ɲɛj	-2474
▁sam	-2475
eːɡ	-2476
ætʃ	-2477
▁pi	-2478
ɦø̞	-2479
oːv	-2480
▁waŋ	-2481
▁ɥi	-2482
▁ˈkl	-2483
əw˧˧	-2484
▁tʁɛ	-2485
▁lˌ	-2486
▁rek	-2487
ɭʎ	-2488
▁bˈɛ	-2489
aʊs	-2490
ˈkeɪ	-2491
▁əˈv	-2492
ðeɾ	-2493
ɪfɝ	-2494
▁tip	-2495
ɣaɾ	-2496
▁rɔz	-2497
▁diə	-2498
at͡ʂ	-2499
aɪzd	-2500
ɯɴ	-2501
jit	-2502
l̪ɐ	-2503
adɐ	-2504
itaɾ	-2505
ɪeː	-2506
pː	-2507
aft	-2508
over	-2509
aɪmz	-2510
▁ˈiŋ	-2511
▁ɲiə	-2512
▁zn	-2513
ɔw	-2514
ɛmb	-2515
nda	-2516
jut	-2517
ˈuŋ	-2518
▁mjɛ	-2519
ɪkɫi	-2520
▁dɪs	-2521
▁kɐɾ	-2522
▁miz	-2523
j̃tu	-2524
▁tẽ	-2525
▁ɛŋ	-2526
▁ʔe	-2527
ande	-2528
▁lok	-2529
▁val	-2530
▁pro	-2531
▁kɐ	-2532
▁ist	-2533
▁kul	-2534
ɛdi	-2535
ɝm	-2536
idu	-2537
jemp	-2538
sto	-2539
▁eːk	-2540
ɕt͡ɕ	-2541
aːr	-2542
skji	-2543
ˈɔrt	-2544
kjɛ	-2545
▁wˌ	-2546
▁mɔʐ	-2547
ˈud	-2548
ʎʎi	-2549
▁əd	-2550
nth	-2551
ˈini	-2552
ɡʌ̹	-2553
ake	-2554
▁pˈɛ	-2555
və	-2556
sti	-2557
əˈɡ	-2558
▁tɨm	-2559
j˧˩˨	-2560
ˌeɪt	-2561
kata	-2562
▁nɛ̝	-2563
ŋɡi	-2564
ɔrt	-2565
▁dɛp	-2566
▁mwi	-2567
▁ver	-2568
▁ɡw	-2569
▁ɛd	-2570
▁daw	-2571
▁pˈo	-2572
əˌk	-2573
gan	-2574
ɡɯɭ	-2575
▁ɪs̪	-2576
▁tˈo	-2577
äːt̪	-2578
laeç	-2579
ɝtʃ	-2580
▁kɾ	-2581
▁pol	-2582
jʊɹ	-2583
βl	-2584
▁ve	-2585
eːʃ	-2586
not	-2587
əŋk	-2588
ʏɾ	-2589
d͡ʑu	-2590
əŋ˧˧	-2591
i˧˩˨	-2592
fɔɾ	-2593
▁ɛm	-2594
ojoɯ	-2595
tif	-2596
zɪŋ	-2597
lam	-2598
▁ɪks	-2599
▁jam	-2600
a˧˩˨	-2601
ːt	-2602
ime	-2603
bah	-2604
iəsə	-2605
lən	-2606
▁oβ	-2607
nts	-2608
▁að	-2609
ush	-2610
▁səd	-2611
sˈi	-2612
ajɔ̃	-2613
▁lɯə	-2614
ʌ̹k̚	-2615
▁faz	-2616
▁dir	-2617
nɔ̃	-2618
ˈawa	-2619
nu	-2620
▁ʝa	-2621
den	-2622
▁ɔf	-2623
ɔvɨ	-2624
ˈaɡ	-2625
aɾˈb	-2626
tok	-2627
▁xɔ	-2628
tan	-2629
bʁ	-2630
ˌʔ	-2631
ɛtɪŋ	-2632
sjɔn	-2633
ɔvɨx	-2634
ˈkɹ	-2635
ɯ˧ˀ˥	-2636
klɪç	-2637
ɔɹn	-2638
ʃə	-2639
vo	-2640
▁dʒ	-2641
ɪc	-2642
ɾaɾ	-2643
▁mˈɛ	-2644
ɲjʌ̹	-2645
ɑnˌt	-2646
sɛs	-2647
ʋäː	-2648
gun	-2649
▁ty	-2650
▁pˈi	-2651
ŋks	-2652
▁nəɡ	-2653
sɔn	-2654
▁fil	-2655
▁bˈo	-2656
jø	-2657
ɯɰβa	-2658
imi	-2659
▁jiə	-2660
had	-2661
▁fʂɨ	-2662
▁aɫ	-2663
uːt	-2664
▁kˈɛ	-2665
ɨz	-2666
▁hwă	-2667
aɾju	-2668
jɯ	-2669
yɾ	-2670
ˈɪt	-2671
ʊŋs	-2672
ˈeːn	-2673
ʃʃ	-2674
jɛnt	-2675
oːt	-2676
iət	-2677
ujɛ	-2678
ɤ˧˨	-2679
ifik	-2680
æmp	-2681
pːʌ	-2682
▁ʼ	-2683
ɾaeç	-2684
wi˧˧	-2685
gɾ	-2686
▁bɤ̆	-2687
ʊɾx	-2688
ɛːt	-2689
▁emp	-2690
͡ɪr	-2691
ham	-2692
rɔ	-2693
ʌk	-2694
ɛlɐ	-2695
dek	-2696
▁inf	-2697
ɝˈt	-2698
▁kʁ	-2699
ɛndə	-2700
▁pat	-2701
▁aʒ	-2702
ʌd̪ɯ	-2703
äːj	-2704
▁ʔɯ	-2705
▁bɛ	-2706
əbɫi	-2707
soɯ	-2708
fɔʁ	-2709
ˌɾ	-2710
▁eˈ	-2711
ˈual	-2712
haɴ	-2713
▁ˈis	-2714
ɹoʊ	-2715
ˌl	-2716
▁ˌp	-2717
ɔna	-2718
eɪɫz	-2719
inz	-2720
ɛtʁ	-2721
ram	-2722
▁kɾe	-2723
nit	-2724
ɑːk	-2725
ɨɡ	-2726
vən	-2727
▁jɤ	-2728
iːk	-2729
▁sɛ̃	-2730
jat	-2731
vd	-2732
jil	-2733
daɴ	-2734
▁ɡˌe	-2735
▁mex	-2736
▁otɾ	-2737
ɹɑbɫ	-2738
ɯw˧˧	-2739
zɯ	-2740
oŋ	-2741
ize	-2742
fən	-2743
dɛ̝	-2744
ʌɡ	-2745
alm	-2746
ɪ̃n̪	-2747
ɦa̠ɭ	-2748
▁ˈsw	-2749
imas	-2750
iʃ	-2751
dap	-2752
ɨr	-2753
ˈdʒ	-2754
ẽs	-2755
nas	-2756
imp	-2757
vis	-2758
▁mˈi	-2759
ʊts	-2760
▁liv	-2761
▁dun	-2762
ẽtʃi	-2763
w˨˦	-2764
ha̠n	-2765
▁no̞	-2766
dem	-2767
▁ˌɑp	-2768
ˈjun	-2769
▁fɯə	-2770
ɹˈe	-2771
▁pɐ	-2772
stsh	-2773
oor	-2774
fl	-2775
▁k͈	-2776
ˈaŋk	-2777
ˈti	-2778
toɾ	-2779
tuʃ	-2780
eɪb	-2781
θaʊt	-2782
l̪eː	-2783
▁ez	-2784
▁eː	-2785
gai	-2786
əʃ	-2787
▁kɛ̝	-2788
kap	-2789
idz	-2790
wɝd	-2791
an˩˧	-2792
ʌ̹ɾ	-2793
d̪ɯ	-2794
βil	-2795
poz	-2796
ɕɛ	-2797
jim	-2798
ats	-2799
▁mil	-2800
▁ʒa	-2801
ætə	-2802
ekɯ	-2803
ɯkɯ	-2804
suːɾ	-2805
ðos	-2806
▁uz	-2807
ikɯ	-2808
▁æk	-2809
ɡi͡	-2810
oj˨˦	-2811
eɪtɝ	-2812
bɨ	-2813
ba̠	-2814
▁pjɛ	-2815
▁kuʁ	-2816
▁ŋu	-2817
ːa	-2818
ishɯ	-2819
ɛft	-2820
▁ʎe	-2821
ɔ̃k	-2822
eːl	-2823
ɛndz	-2824
ɦäː	-2825
ɲt͡ɕ	-2826
▁ev	-2827
ɫɪŋ	-2828
▁maʁ	-2829
▁ˈkɝ	-2830
ʊks	-2831
was	-2832
ˌts	-2833
ɔtɝ	-2834
iːlə	-2835
▁kim	-2836
▁mun	-2837
ʎa	-2838
▁mɐ	-2839
tɕik	-2840
▁mji	-2841
▁baɡ	-2842
▁jˈa	-2843
▁def	-2844
sjo	-2845
ɔnɛ	-2846
ˈaŋs	-2847
ʒuʁ	-2848
▁með	-2849
▁tɛr	-2850
▁ʔʌ	-2851
▁sɯ	-2852
tos	-2853
▁ˈɫɑ	-2854
▁dat	-2855
▁uno	-2856
▁çi	-2857
ˈont	-2858
ɪɹiə	-2859
pʁ	-2860
dz	-2861
ʎu	-2862
ʊɹɪŋ	-2863
▁ˈtɾ	-2864
vz	-2865
vu	-2866
ɕhim	-2867
hai	-2868
▁aɡ	-2869
▁dit	-2870
▁ʃt	-2871
w˧˨	-2872
▁ẽtɾ	-2873
ʈɐ	-2874
▁ɔs	-2875
ˈaha	-2876
ˈi͡e	-2877
ade	-2878
▁kəb	-2879
▁wɪˈ	-2880
isɯ	-2881
▁zo	-2882
kɪŋ	-2883
ten	-2884
i͡un	-2885
ˈɾia	-2886
pon	-2887
bẽj̃	-2888
wɛ̃	-2889
▁jaŋ	-2890
▁kər	-2891
▁mɨ	-2892
o̞ɡ	-2893
ori	-2894
ˌu	-2895
oːs	-2896
aʊɝ	-2897
ä̃ːm	-2898
▁kɾi	-2899
enta	-2900
iti	-2901
ˈaɡa	-2902
əˈp	-2903
ɑ̃dʁ	-2904
çar	-2905
ɔft	-2906
ɕika	-2907
▁fal	-2908
isk	-2909
▁vɔl	-2910
ĭoː	-2911
ʌ̹t̚	-2912
stɾa	-2913
ɛçt	-2914
ŋɡʌɭ	-2915
rɨ	-2916
kit	-2917
ɪʃə	-2918
tim	-2919
ɛkts	-2920
mpl	-2921
ari	-2922
tər	-2923
ɡen	-2924
ˈani	-2925
▁pal	-2926
ps͈	-2927
ɯɭɭ	-2928
ˈee	-2929
eːr	-2930
wɨ	-2931
nom	-2932
▁sil	-2933
▁esk	-2934
ˈuːr	-2935
j˧˧	-2936
▁bal	-2937
ˈiːr	-2938
pɯ	-2939
tɨʃ	-2940
taɴ	-2941
βax	-2942
ˈju	-2943
imn	-2944
ɑːt	-2945
ɑr	-2946
▁haj	-2947
ẽd	-2948
ðoɾ	-2949
ɛt˦˥	-2950
▁zd	-2951
▁ol	-2952
oɾt	-2953
nde̞	-2954
hˌ	-2955
▁art	-2956
▁ˌop	-2957
ndən	-2958
ɲɲ	-2959
diə	-2960
jene	-2961
▁ɾe	-2962
▁s̪ɐ	-2963
skjɛ	-2964
nɪs	-2965
▁mˌa	-2966
ːn	-2967
▁lan	-2968
ʌt̪ː	-2969
nt͡s	-2970
▁dɔn	-2971
▁otʁ	-2972
toki	-2973
amm	-2974
t͡ʃh	-2975
ˈiə	-2976
▁hoʊ	-2977
a̠k̚	-2978
pˌe	-2979
çiɴ	-2980
ˈɛra	-2981
ˈahu	-2982
▁ˈha	-2983
ʊkt	-2984
▁dem	-2985
lɪçə	-2986
oːɾ	-2987
▁pɔz	-2988
ɡl	-2989
pɫ	-2990
ɪft	-2991
ɛ̝k̚	-2992
ˈiap	-2993
kɔm	-2994
kuɫ	-2995
ɛbˌs	-2996
thɯ	-2997
▁iɭ	-2998
ase	-2999
ɹen	-3000
sid	-3001
ha̠ɾ	-3002
▁ˈɡɫ	-3003
▁kɔr	-3004
ɾos	-3005
▁ru	-3006
alid	-3007
ɯɾɯɭ	-3008
oːl	-3009
pəni	-3010
toi	-3011
▁meʒ	-3012
▁and	-3013
ess	-3014
ŋkin	-3015
ˈudi	-3016
onal	-3017
▁lɛ	-3018
paɾ	-3019
kõ	-3020
ˈsɛs	-3021
amɨ	-3022
▁əˈf	-3023
ˈmb	-3024
she̞	-3025
▁ʁɑ̃	-3026
teɴ	-3027
ˈʃʊɹ	-3028
xo	-3029
ˈð	-3030
▁ʔɪn	-3031
ɐn̪ɐ	-3032
ʒẽj̃	-3033
▁met	-3034
▁mɔj	-3035
dis	-3036
sjal	-3037
▁fat	-3038
tuː	-3039
ˈpɛɹ	-3040
ias	-3041
non	-3042
tap	-3043
ɔnɨ	-3044
eɪɪŋ	-3045
ɦɛ̝ŋ	-3046
▁mɪç	-3047
jɛn	-3048
ru	-3049
ɛmbɝ	-3050
▁sm	-3051
▁jɯŋ	-3052
ɯɡ	-3053
ɔʁt	-3054
alle	-3055
▁osi	-3056
ktʃu	-3057
▁ɡɔ	-3058
ort	-3059
▁eŋk	-3060
▁bəɡ	-3061
aɪɫd	-3062
aːk	-3063
ɛsso	-3064
ˈæ	-3065
ˈtɪn	-3066
ˈitu	-3067
ətɫi	-3068
vji	-3069
▁ɔʁ	-3070
nəðɝ	-3071
▁xwe	-3072
▁sɨɣ	-3073
▁swa	-3074
ʂɨm	-3075
▁tət	-3076
dik	-3077
saɾ	-3078
wʌ̹	-3079
ver	-3080
nama	-3081
ʎo	-3082
▁koɾ	-3083
pɾe	-3084
ˈaku	-3085
▁ˈam	-3086
dək	-3087
yt	-3088
sho̞	-3089
dɝ	-3090
▁äːp	-3091
enˌf	-3092
s̪eː	-3093
▁dam	-3094
▁gɾ	-3095
▁ɡɾ	-3096
ɣa	-3097
▁nˈi	-3098
ɾɐʃ	-3099
do̞ŋ	-3100
ɾiβ	-3101
ani	-3102
▁sĩ	-3103
▁pɔv	-3104
ɾɐs	-3105
jɛl	-3106
ˈteɪ	-3107
▁mom	-3108
▁wɛb	-3109
ɳɐ	-3110
õj̃s	-3111
▁ˈɑ	-3112
▁ˌɪˈ	-3113
k͡p	-3114
ʏn	-3115
▁amb	-3116
ɪzɪt	-3117
äːd̪	-3118
ɾɯm	-3119
ond	-3120
▁dˈa	-3121
ɛɦ	-3122
▁nuʃ	-3123
idʑ	-3124
ũː	-3125
ˈɪk	-3126
ets	-3127
▁səɡ	-3128
atˈa	-3129
okoɯ	-3130
idɪŋ	-3131
jɝ	-3132
ɪfɪk	-3133
▁sɛr	-3134
aʊz	-3135
ɯtɕi	-3136
shu	-3137
▁fw	-3138
aːbə	-3139
ərl	-3140
▁tra	-3141
fjɛ	-3142
▁əp	-3143
▁kɯə	-3144
heɴ	-3145
ʈh	-3146
a̠nɡ	-3147
zaɪn	-3148
ɪps	-3149
ɛsu	-3150
ɛvi	-3151
kakɯ	-3152
ədʒ	-3153
stal	-3154
ɕha̠	-3155
▁ʒuʁ	-3156
▁wˈe	-3157
▁ɾəɦ	-3158
ida	-3159
▁ɡo	-3160
aɪ̯l	-3161
vɛ	-3162
ɕin	-3163
sakɯ	-3164
zai	-3165
ulaɾ	-3166
▁mwa	-3167
fɾ	-3168
imz	-3169
node	-3170
ɲos	-3171
ʏk	-3172
▁baz	-3173
ɹɑdʒ	-3174
ˈek	-3175
▁ce	-3176
ma̠	-3177
rat	-3178
ɫu	-3179
▁zɛ	-3180
val	-3181
ɐmɐ	-3182
etsɯ	-3183
kaz	-3184
▁sər	-3185
ənθ	-3186
ˈoto	-3187
d͡zɔ	-3188
ile	-3189
bjɛ	-3190
ɔɪd	-3191
in˧˨	-3192
t̪ɐ	-3193
ðɝz	-3194
▁kəd	-3195
jak	-3196
gaɾ	-3197
vɐ	-3198
dan	-3199
▁pɹi	-3200
ˈulu	-3201
phum	-3202
▁mɑː	-3203
ɪsts	-3204
▁vwa	-3205
ɔra	-3206
ox	-3207
▁ˈar	-3208
ple	-3209
▁χ	-3210
ˌwɛɹ	-3211
stəm	-3212
wah	-3213
ĩdɐ	-3214
▁ˈɔø	-3215
▁ɔɫ	-3216
ibu	-3217
vɝs	-3218
▁kɐ̃	-3219
ðuʃ	-3220
▁up	-3221
ɛtto	-3222
tas	-3223
ʂa	-3224
sl	-3225
mẽ	-3226
nina	-3227
kɾ	-3228
ʒɐ	-3229
oɴna	-3230
▁əˈn	-3231
em˧˧	-3232
ˈɛkt	-3233
▁tɛʁ	-3234
vɨ	-3235
▁ˈkɔ	-3236
bːen	-3237
βes	-3238
▁sfɔ	-3239
turɛ	-3240
▁sar	-3241
ɪnz	-3242
klu	-3243
bɔ	-3244
tˈe	-3245
uŋk	-3246
▁baɾ	-3247
t̪iː	-3248
mae	-3249
kɔ̃	-3250
▁dep	-3251
▁pɾu	-3252
naka	-3253
əɦĩː	-3254
▁dɤ̆	-3255
▁hˈu	-3256
eɪp	-3257
seɴ	-3258
ˈial	-3259
blik	-3260
▁ŋi	-3261
enti	-3262
▁ˈum	-3263
anti	-3264
k͈a̠	-3265
▁lɯk	-3266
▁tʃ	-3267
ɪd͡ʒ	-3268
ɪvɪŋ	-3269
ɛθ	-3270
▁ɡˈɛ	-3271
ip̚	-3272
sje	-3273
tɕoɯ	-3274
ɾə	-3275
stɛm	-3276
eg	-3277
aŋɡ	-3278
ˈɡ	-3279
▁kɑ̃	-3280
u˧˨	-3281
kul	-3282
▁ɛk	-3283
äːɦ	-3284
▁sej	-3285
ɛllo	-3286
ˈmal	-3287
▁pot	-3288
▁viv	-3289
▁mɯ	-3290
ɹaː	-3291
nto	-3292
aɪɝd	-3293
eɾi	-3294
tura	-3295
jik	-3296
▁dʁ	-3297
əmbɝ	-3298
ɾjʌ̹	-3299
blɛm	-3300
▁ˌt	-3301
udɪŋ	-3302
ɡi͡e	-3303
▁tit	-3304
▁ˌɛs	-3305
eɪf	-3306
ijäː	-3307
ɔff	-3308
ɛsta	-3309
mos	-3310
t͡sɨ	-3311
mini	-3312
k͈o̞	-3313
ˈiːk	-3314
▁sen	-3315
emən	-3316
ame	-3317
aっte	-3318
̪äː	-3319
ˌe˧˧	-3320
tst	-3321
ɝəɫ	-3322
▁lat	-3323
jone	-3324
ædʒ	-3325
▁mis	-3326
▁ʃe	-3327
oɾis	-3328
ɾik	-3329
▁sˈo	-3330
ərn	-3331
t͡ʃe	-3332
▁aʝ	-3333
▁je̞	-3334
▁daː	-3335
▁iz	-3336
▁diz	-3337
▁eki	-3338
aɲ	-3339
▁ˈe	-3340
▁lav	-3341
ka͡ɪ	-3342
ɔll	-3343
fo	-3344
əd͡ʒ	-3345
▁bes	-3346
zeɴ	-3347
▁ɛg	-3348
ɫəs	-3349
ˈsɪd	-3350
ˈʃt	-3351
d͡ʒo	-3352
▁bɾa	-3353
ɛŋ˧˨	-3354
ɡa̠n	-3355
vɛʁ	-3356
l̪iː	-3357
▁gə	-3358
▁lup	-3359
ʃtɨ	-3360
▁ˈsɫ	-3361
▁ten	-3362
kot	-3363
▁ɪm	-3364
erv	-3365
bˈeː	-3366
kɯn	-3367
ht	-3368
ˈiːn	-3369
▁haŋ	-3370
mjɛ	-3371
▁pap	-3372
ɑːj	-3373
▁jo	-3374
ænz	-3375
ejs	-3376
zoɯ	-3377
▁ʁap	-3378
aðu	-3379
ŋɡu	-3380
ətɪŋ	-3381
▁rik	-3382
ˈakt	-3383
▁dif	-3384
uˈar	-3385
ʌɳ	-3386
▁ˈɹæ	-3387
kɛ	-3388
anɛ	-3389
▁lib	-3390
▁aks	-3391
▁ete	-3392
▁pɔp	-3393
▁ˈuː	-3394
▁fsp	-3395
ɪkən	-3396
ədi	-3397
ˈɛɡ	-3398
æɫju	-3399
▁ɡˈo	-3400
ɫɛkt	-3401
oi	-3402
era	-3403
eni	-3404
▁mɛd	-3405
əˌm	-3406
inu	-3407
sere	-3408
ðes	-3409
aɪb	-3410
ʃp	-3411
▁sl	-3412
ʂt͡ʂ	-3413
▁ob	-3414
▁ʒy	-3415
▁ĩf	-3416
ðɐ	-3417
▁tɨl	-3418
mal	-3419
▁dos	-3420
▁isu	-3421
▁vj	-3422
▁moː	-3423
tiɾ	-3424
▁lin	-3425
▁ˈoː	-3426
jam	-3427
▁ˌon	-3428
ɕ͈i	-3429
▁ɕi	-3430
ˈaːɡ	-3431
ɔvɛj	-3432
▁tin	-3433
ntr	-3434
pet	-3435
gaɴ	-3436
ẽdu	-3437
▁kuj	-3438
stʁ	-3439
▁ˈun	-3440
▁sɥ	-3441
ual	-3442
ɛɾz	-3443
▁ɡˈa	-3444
ɪdi	-3445
bun	-3446
▁e̞	-3447
̃n̪	-3448
▁siɣ	-3449
ɝt	-3450
jir	-3451
▁ˈad	-3452
▁bɪt	-3453
▁poː	-3454
ˌi	-3455
▁fɔr	-3456
itɪŋ	-3457
æv	-3458
eːg	-3459
ɹɑpɝ	-3460
ˈwin	-3461
æɡ	-3462
▁fɾ	-3463
▁ˈaj	-3464
▁ˌɛn	-3465
ɫiv	-3466
βis	-3467
▁ʒɛ	-3468
eːɾ	-3469
asz	-3470
d͡zɛ	-3471
ɯŋ˧˨	-3472
▁ˈin	-3473
iːs	-3474
▁pul	-3475
▁nˈa	-3476
eɪmz	-3477
ˈɛli	-3478
▁bɐ	-3479
▁tɛl	-3480
▁sɥi	-3481
dɯ	-3482
ɑːs	-3483
oɾo	-3484
ˌo	-3485
▁bɔ̃	-3486
▁var	-3487
ɝɪŋ	-3488
ʒɛ	-3489
əpəɫ	-3490
▁zak	-3491
fə	-3492
ɪˈz	-3493
dup	-3494
ˌkɹ	-3495
▁bat	-3496
ˈank	-3497
siz	-3498
orm	-3499
tɾu	-3500
gata	-3501
t̪ːɯ	-3502
ɹiz	-3503
dəkt	-3504
ɔɪs	-3505
▁ɔn	-3506
ɡoʊ	-3507
əks	-3508
land	-3509
itad	-3510
ッkɯ	-3511
ʁən	-3512
iɾo	-3513
œl	-3514
▁sɝ	-3515
dat	-3516
əmɝ	-3517
mˈa	-3518
ard	-3519
▁dø	-3520
sist	-3521
ˌɛt	-3522
sjas	-3523
jus	-3524
βo̞	-3525
imj	-3526
▁stu	-3527
nəf	-3528
▁hɯ	-3529
˧˧s	-3530
ɔøʧ	-3531
▁imb	-3532
▁bək	-3533
▁õ	-3534
▁dɔx	-3535
the̞	-3536
▁aɣ	-3537
▁ɡɦ	-3538
wən	-3539
xeɾ	-3540
eːkh	-3541
▁ɡl	-3542
ək˦˥	-3543
▁hˈɪ	-3544
ubˈu	-3545
gʁ	-3546
▁kuɾ	-3547
ˈtɝn	-3548
æts	-3549
bal	-3550
ɴde	-3551
vwaʁ	-3552
ʎi	-3553
▁sj	-3554
gl	-3555
ˈeɹe	-3556
▁mɔl	-3557
ˈaːk	-3558
▁tʌ̹	-3559
▁shɯ	-3560
▁ɡˈu	-3561
tomo	-3562
omb	-3563
▁ˌh	-3564
äːs̪	-3565
▁ẽt	-3566
▁jɡ	-3567
▁bˌa	-3568
▁bʁ	-3569
ɕɐ	-3570
▁bɛɲ	-3571
▁sat	-3572
▁juʂ	-3573
pst	-3574
▁ɲˈa	-3575
jən	-3576
ɹɛkt	-3577
▁muz	-3578
aðas	-3579
ˌdeɪ	-3580
sɨj	-3581
d͡ʒə	-3582
ɝˌst	-3583
▁diʁ	-3584
inən	-3585
idi	-3586
kɔʁ	-3587
ɛʒ	-3588
ɑːp	-3589
ɫɪ	-3590
▁d̪ɦ	-3591
iŋk	-3592
ɑːʋ	-3593
ˈɛŋ	-3594
tom	-3595
▁wan	-3596
▁ax	-3597
haj	-3598
osɯ	-3599
i͡ə	-3600
▁ˌal	-3601
▁rɛ	-3602
▁ix	-3603
olˈo	-3604
ɝv	-3605
jar	-3606
▁ˈɛk	-3607
▁vit	-3608
ŋɡa̠	-3609
▁kx	-3610
▁mɛʁ	-3611
▁hăj	-3612
rɛ	-3613
ndə	-3614
ɯkː	-3615
yn	-3616
rɯ	-3617
kɛt	-3618
▁ˈon	-3619
▁zˈo	-3620
ɪnə	-3621
jɛm	-3622
ẽsjɐ	-3623
ao	-3624
ˌwɝ	-3625
ðen	-3626
buh	-3627
hata	-3628
oso	-3629
▁ris	-3630
ɪsk	-3631
mt	-3632
inas	-3633
deki	-3634
▁pan	-3635
ˈup	-3636
▁or	-3637
jji	-3638
▁fe	-3639
ɡɐ	-3640
gah	-3641
oku	-3642
usah	-3643
waɾ	-3644
ma̠n	-3645
▁dăk	-3646
fɹ	-3647
ntah	-3648
udən	-3649
iw	-3650
▁ˈla	-3651
▁kaʐ	-3652
anus	-3653
alji	-3654
▁ʈɤ	-3655
sɨx	-3656
nɯ	-3657
▁ɰi	-3658
atik	-3659
ɹˈoː	-3660
ɛln	-3661
▁i˧˧	-3662
▁pɾɐ	-3663
vɝi	-3664
▁ɤ̆m	-3665
▁ʁeʒ	-3666
▁rˈa	-3667
▁kor	-3668
▁ɛgz	-3669
▁ʔʊn	-3670
ɪll	-3671
▁maŋ	-3672
ɐ̃tu	-3673
oza	-3674
▁san	-3675
ɡũ	-3676
͡ɪl	-3677
▁hˈa	-3678
ˌɛm	-3679
ɛ̝ɡ	-3680
ərt	-3681
d͡ʑɐ	-3682
hah	-3683
ʋɑː	-3684
▁vol	-3685
ˈjʊɹ	-3686
ɛtv	-3687
▁bɤj	-3688
akaɾ	-3689
aʊd	-3690
ɯk̚	-3691
saɪd	-3692
ʒis	-3693
kɔl	-3694
uɾm	-3695
ɪnn	-3696
▁kil	-3697
ho	-3698
ʝi	-3699
▁tɛm	-3700
aɪp	-3701
kɔv	-3702
ɪsən	-3703
▁nap	-3704
dʁ	-3705
tet	-3706
bo	-3707
ojʃ	-3708
ɛt͡ʂ	-3709
eːs̪	-3710
ɪld	-3711
▁num	-3712
ban	-3713
lat	-3714
kuf	-3715
ɕiki	-3716
▁mɛ̃	-3717
▁ɲi	-3718
jɛkt	-3719
peɾ	-3720
awɨ	-3721
zokɯ	-3722
▁fik	-3723
w˧ˀ˥	-3724
▁ɹiˈ	-3725
▁ˈɪm	-3726
ˈɪd	-3727
▁kaj	-3728
baŋ	-3729
ɝnd	-3730
ɹɛs	-3731
ẽsja	-3732
ərd	-3733
ɑmp	-3734
▁saj	-3735
ɪŋɡ	-3736
ɕhø̞	-3737
laŋ	-3738
▁liβ	-3739
ɕijo	-3740
ˈeːʀ	-3741
ɫəˈ	-3742
əˈfɛ	-3743
sik	-3744
▁ɹˌ	-3745
ˈɾan	-3746
▁rel	-3747
▁fun	-3748
▁ɔtp	-3749
▁kɝ	-3750
ɣos	-3751
nan	-3752
kei	-3753
▁pre	-3754
uːr	-3755
əiːl	-3756
kin	-3757
amj	-3758
sis	-3759
kur	-3760
ətən	-3761
ɪstɝ	-3762
▁ʋɨ	-3763
ie	-3764
tiz	-3765
▁bj	-3766
▁lɤ̆	-3767
ðas	-3768
▁hˈɛ	-3769
▁mad	-3770
l̪äː	-3771
ˈaːm	-3772
▁rˈi	-3773
jœʁ	-3774
eɪnz	-3775
▁lɔʁ	-3776
▁etɛ	-3777
bs	-3778
▁pɨ	-3779
▁jaː	-3780
stan	-3781
βen	-3782
ɪntɝ	-3783
nam	-3784
ˈaat	-3785
ɛɾv	-3786
itik	-3787
kˈa	-3788
ɡjʌ̹	-3789
awɔ	-3790
xa	-3791
ɜː	-3792
▁ɾäː	-3793
▁bah	-3794
ɛɾk	-3795
▁kwa	-3796
ɔɹts	-3797
ˌan	-3798
ɛʃəɫ	-3799
aʊ̯	-3800
ˈuti	-3801
ɝnɪŋ	-3802
ɔøt	-3803
bab	-3804
ッto	-3805
əpʁ	-3806
ɛɕ	-3807
izas	-3808
▁mɔd	-3809
▁dom	-3810
ɑɾən	-3811
tr	-3812
ˈaŋɡ	-3813
paʁ	-3814
ɛʁn	-3815
▁dip	-3816
▁of	-3817
▁kum	-3818
sts	-3819
ˈmas	-3820
▁lɥi	-3821
▁ø	-3822
▁pɔs	-3823
utt͡	-3824
ˈdi	-3825
tem	-3826
ɪˈv	-3827
▁ɛ̝	-3828
axən	-3829
ˈoba	-3830
ˈion	-3831
atiβ	-3832
tsɯɯ	-3833
ːʌɪ̯	-3834
▁vɛʁ	-3835
okai	-3836
▁py	-3837
ezə	-3838
ɯkːɯ	-3839
ɑts	-3840
nten	-3841
▁ĩp	-3842
d͡ʒd	-3843
ɛsɐ	-3844
▁kos	-3845
ɑtʃ	-3846
əŋ˦˨	-3847
aen	-3848
▁mɑ̃	-3849
ɹə	-3850
ive	-3851
ult	-3852
ɡus	-3853
ɯɾʌ̹	-3854
▁ʈaj	-3855
deɕi	-3856
boɯ	-3857
▁fũ	-3858
ɡo̞ŋ	-3859
oʊs	-3860
na̠	-3861
vɛl	-3862
ɲɛm	-3863
ʊɾts	-3864
əmɪŋ	-3865
kat	-3866
asˈi	-3867
ɪɫz	-3868
eo	-3869
pas	-3870
ə̃ɳ	-3871
▁tem	-3872
ˈɪc	-3873
iðos	-3874
vɑ̃	-3875
▁sek	-3876
▁hɔj	-3877
nad	-3878
anno	-3879
▁ɐjʃ	-3880
ɔlt	-3881
▁rˈu	-3882
▁ˈɛf	-3883
ɯkoɯ	-3884
eːʈ	-3885
dɯɭ	-3886
mpu	-3887
▁ɑ̃f	-3888
inaɾ	-3889
▁ˈtw	-3890
▁ˈʃl	-3891
ment	-3892
dɛnt	-3893
▁ʁep	-3894
mẽtɨ	-3895
▁ruv	-3896
▁dok	-3897
▁lɤj	-3898
▁lak	-3899
▁vɛ	-3900
rk	-3901
əndʒ	-3902
▁ˈfi	-3903
asa	-3904
▁dik	-3905
onom	-3906
ɪb	-3907
▁pɔr	-3908
t͈o̞	-3909
ɪŋən	-3910
kjɯɯ	-3911
uːɐ	-3912
ɐ̯ʊŋ	-3913
seɾ	-3914
ˈtɪɫ	-3915
ɑːɡa	-3916
ɑɹm	-3917
▁s͈	-3918
wɔv	-3919
▁atɛ	-3920
▁deʒ	-3921
xen	-3922
ẽtuʃ	-3923
ˈim	-3924
ɔɾd	-3925
▁sɪk	-3926
nd͡z	-3927
ərh	-3928
øz	-3929
ɹɪŋ	-3930
ɛkn	-3931
adus	-3932
tel	-3933
▁bak	-3934
kiː	-3935
ntɝˌ	-3936
▁lim	-3937
suk	-3938
ɾim	-3939
ɕhiɭ	-3940
▁ʒi	-3941
okaɴ	-3942
▁bɛl	-3943
t͡ɕa	-3944
əɪst	-3945
uto	-3946
uːn	-3947
fjat	-3948
͡ɪt	-3949
ˈerk	-3950
las	-3951
▁vɔ	-3952
ˌede	-3953
mit	-3954
▁bət	-3955
▁məˈ	-3956
ido̞	-3957
kun	-3958
eːz	-3959
▁tˈ	-3960
▁poz	-3961
ăp˦˥	-3962
ɛndo	-3963
▁ʐɨ	-3964
maˈ	-3965
turɨ	-3966
▁med	-3967
fɔɾm	-3968
▁sɨɾ	-3969
▁mɛt	-3970
▁ˌɔɹ	-3971
tɐs	-3972
raf	-3973
▁bud	-3974
niɴ	-3975
baɡ	-3976
aɪnz	-3977
kom	-3978
▁ɡəb	-3979
og	-3980
adˈi	-3981
jah	-3982
əˈf	-3983
eɪnt	-3984
ɹˈiː	-3985
wu	-3986
pˈe	-3987
əmˈu	-3988
ˈtɪv	-3989
pə	-3990
ɡɯn	-3991
ɑːɡ	-3992
▁ʃɑ̃	-3993
▁ter	-3994
vid	-3995
▁ul	-3996
▁twa	-3997
▁nam	-3998
▁vˈɪ	-3999
stɾo	-4000
θɪn	-4001
im˧˧	-4002
ojo	-4003
ɾjo	-4004
aro	-4005
ɔɹz	-4006
▁ˌa	-4007
ɔro	-4008
▁pek	-4009
tuɾa	-4010
maɾ	-4011
▁ale	-4012
ɛp˦˥	-4013
ero	-4014
▁zˈ	-4015
▁kəh	-4016
▁mes	-4017
ɾus	-4018
ʊɾdə	-4019
▁ˈmœ	-4020
ae	-4021
▁zam	-4022
ɔrd	-4023
ʂɨx	-4024
▁vil	-4025
p˧˧	-4026
ˌdʒ	-4027
œv	-4028
ˈɛvɝ	-4029
▁ʂɯə	-4030
yd	-4031
▁daɾ	-4032
ɦiː	-4033
▁lˈe	-4034
ʒəw	-4035
ʃɪp	-4036
ɛnʃ	-4037
o̞m	-4038
▁ˈç	-4039
▁ˈbr	-4040
ăm˨˦	-4041
əm˨˦	-4042
gam	-4043
▁ɛsp	-4044
fɪkt	-4045
▁dab	-4046
ɹˈ	-4047
ʁɔ̃	-4048
▁ciə	-4049
eːv	-4050
əd̪	-4051
▁ɣɔj	-4052
ɹˌ	-4053
▁sim	-4054
ɪʒən	-4055
ðɐʃ	-4056
lant	-4057
ɛvəɫ	-4058
nti	-4059
ætɝ	-4060
e̞i	-4061
teʁ	-4062
▁ˈpu	-4063
ˈusi	-4064
ˈba	-4065
jum	-4066
lɑ	-4067
aːt	-4068
▁ˈɾa	-4069
▁ɦiː	-4070
oːf	-4071
▁jəɦ	-4072
da̠n	-4073
ʁiʁ	-4074
mbər	-4075
▁pɔm	-4076
ədən	-4077
ɡas	-4078
ɑks	-4079
dˈap	-4080
ɪvən	-4081
und	-4082
ɛnz	-4083
▁isk	-4084
▁pəs	-4085
dɯn	-4086
bile	-4087
▁æd	-4088
▁dev	-4089
ole	-4090
ɕlji	-4091
ˈina	-4092
ɡo	-4093
ɥe	-4094
̪ɯ	-4095
ʊl	-4096
▁ʁət	-4097
ɐ̯ɐ̯	-4098
ona	-4099
▁mʊs	-4100
bli	-4101
nte	-4102
▁pɛ̝	-4103
▁fɤ̆	-4104
buk	-4105
men	-4106
▁ˈdɾ	-4107
siv	-4108
▁tɛʂ	-4109
əmb	-4110
ikos	-4111
pha̠	-4112
▁ha	-4113
ɕhe̞	-4114
paɲ	-4115
d̪ɐ	-4116
ˈbaɽ	-4117
ˈɛda	-4118
pɾi	-4119
ɛɾst	-4120
▁bɾ	-4121
ndi	-4122
▁ˌak	-4123
ɾɐj	-4124
▁paw	-4125
nl	-4126
jəm	-4127
ɫɪʃ	-4128
▁bus	-4129
ɹu	-4130
pɔʁt	-4131
▁uk	-4132
▁jɯk	-4133
▁mem	-4134
avaj	-4135
▁seɣ	-4136
ˈɫeɪ	-4137
oli	-4138
bəl	-4139
▁tɛn	-4140
j˧˨	-4141
ɥɛl	-4142
lɛp	-4143
in̪	-4144
idˈi	-4145
kane	-4146
▁ɹiv	-4147
▁fwe	-4148
ɔɹˈs	-4149
pɔ	-4150
ẽta	-4151
eːt	-4152
ŋg	-4153
eɪɝ	-4154
idiə	-4155
▁sn	-4156
jist	-4157
▁eβ	-4158
▁ˈke	-4159
t͡ʃk	-4160
ɯne	-4161
əsi	-4162
▁asp	-4163
plik	-4164
▁nav	-4165
itas	-4166
▁ˈɫɔ	-4167
▁ʝo	-4168
ˈor	-4169
▁zav	-4170
βw	-4171
ner	-4172
ăm˧˨	-4173
ˈerd	-4174
▁ˈkɾ	-4175
jutə	-4176
ɛlji	-4177
arˈi	-4178
eso	-4179
▁bis	-4180
iɕ	-4181
viəs	-4182
▁pik	-4183
ftar	-4184
▁mɛ̝	-4185
kiɾi	-4186
ʂɐ	-4187
əɫd	-4188
ɖɯ	-4189
yk	-4190
ɲɛʂ	-4191
▁ɑ̃s	-4192
ɐjɾɐ	-4193
kak	-4194
▁we	-4195
ʎɔɾ	-4196
▁hˈo	-4197
əˌs	-4198
▁moj	-4199
▁aki	-4200
ˌas	-4201
ʊst	-4202
əʋ	-4203
ˈpi	-4204
▁skw	-4205
ɪzəm	-4206
▁tam	-4207
deha	-4208
ɣan	-4209
ɡn	-4210
ɛllt	-4211
wɤ̆ŋ	-4212
ikaˈ	-4213
▁pʌ	-4214
ɨp	-4215
βaɾ	-4216
uŋɡ	-4217
▁ˈmʏ	-4218
ˈoːn	-4219
çə	-4220
▁fər	-4221
▁pun	-4222
▁kjɛ	-4223
▁pad	-4224
kɔn	-4225
▁pen	-4226
▁oʊ	-4227
jɐʃ	-4228
deɴ	-4229
▁ish	-4230
dus	-4231
y̯	-4232
ɛtu	-4233
ket	-4234
atœʁ	-4235
▁ʈɯk	-4236
▁ˌɛm	-4237
aɪdz	-4238
▁ese	-4239
tow	-4240
demo	-4241
ʐa	-4242
ɐjtu	-4243
ɕt	-4244
▁bɔn	-4245
gaj	-4246
▁xu	-4247
▁dɛn	-4248
ɪtən	-4249
ʊp	-4250
▁tom	-4251
▁bas	-4252
ɣɾ	-4253
▁ʑ	-4254
▁ˈki	-4255
alˈi	-4256
▁sf	-4257
aɪˈ	-4258
œy̯	-4259
aːɾɐ	-4260
βoɾ	-4261
kɯni	-4262
ɛɹɪŋ	-4263
aɽ	-4264
ɪdz	-4265
ɯɾɯn	-4266
▁ɔm	-4267
dɪk	-4268
ẽti	-4269
dɯɾ	-4270
ɫənd	-4271
ʁt	-4272
▁ʒɑ̃	-4273
▁bol	-4274
▁mew	-4275
▁ɪˈm	-4276
▁ban	-4277
sum	-4278
ɔøtə	-4279
▁maʝ	-4280
izɯ	-4281
▁sɐ	-4282
ɹeɪt	-4283
▁fɔɾ	-4284
▁ˈɡɝ	-4285
ital	-4286
▁pla	-4287
▁ʔʌʋ	-4288
ˈsɛɫ	-4289
ofes	-4290
ljiv	-4291
ɑːb	-4292
▁zm	-4293
rˈi	-4294
stat	-4295
jasɯ	-4296
iph	-4297
ajn	-4298
▁bɪs	-4299
ɪgɐ̯	-4300
mä̃ː	-4301
ɡɪn	-4302
▁diɐ	-4303
ˈɛb	-4304
ŋkat	-4305
ĩdu	-4306
ɛnəf	-4307
▁lɔ̃	-4308
ˈən	-4309
ʃa	-4310
▁not	-4311
▁kuɲ	-4312
pɾɛç	-4313
▁hø̞	-4314
sam	-4315
ˈtɪk	-4316
▁kʁe	-4317
eɾes	-4318
isa	-4319
ɾeɾɯ	-4320
ʎos	-4321
βlik	-4322
▁ras	-4323
▁p͈	-4324
▁far	-4325
oːb	-4326
▁xi	-4327
▁ʁə	-4328
pho̞	-4329
▁mus	-4330
ɲɲi	-4331
▁dwa	-4332
▁xa	-4333
aɾjo	-4334
oʊzd	-4335
▁tː	-4336
tˌe	-4337
▁diʃ	-4338
▁ɣă	-4339
ɹækt	-4340
▁tˈa	-4341
▁tar	-4342
jamo	-4343
anto	-4344
▁lɑ̃	-4345
kiŋ	-4346
ɕhu	-4347
ˈeːb	-4348
▁fiə	-4349
kaɾa	-4350
iːr	-4351
▁ɔɾ	-4352
tʃo	-4353
ɹəns	-4354
ɔltə	-4355
▁ʁəs	-4356
▁pop	-4357
tˈɛ	-4358
ʈːʌ	-4359
ɔpr	-4360
▁ˌɛl	-4361
ˈɐ	-4362
kir	-4363
aʊθ	-4364
▁awt	-4365
ˈtuː	-4366
▁ˌɔr	-4367
uve	-4368
▁kjo	-4369
▁emb	-4370
▁ɐs	-4371
▁hɛ	-4372
▁eɾ	-4373
ɛʃən	-4374
っtak	-4375
ˈop	-4376
gəˈb	-4377
▁eta	-4378
ska	-4379
ɡɯm	-4380
▁pɾa	-4381
ɪtɝ	-4382
▁tek	-4383
▁mɔm	-4384
▁nɔt	-4385
▁ɤ̆j	-4386
glɪç	-4387
lan	-4388
ˈeːm	-4389
ˈtɛɫ	-4390
ˌsɛs	-4391
ŋɡal	-4392
▁det	-4393
▁məd	-4394
ɕikɯ	-4395
▁ʌ̹m	-4396
ɛɾd	-4397
▁ˈʃv	-4398
ɡˈi͡	-4399
ɨja	-4400
▁set	-4401
▁iv	-4402
ipər	-4403
abl	-4404
▁vz	-4405
a̠mn	-4406
▁fwa	-4407
ʈi	-4408
ˈɣ	-4409
ˌal	-4410
əɫts	-4411
jɑː	-4412
juː	-4413
ɛnts	-4414
ˈila	-4415
ˈuru	-4416
ɐ̃tɨ	-4417
anˌt	-4418
oʊˌt	-4419
izmo	-4420
▁vaj	-4421
ɛr˧˧	-4422
▁mʌ	-4423
sus	-4424
▁ˈbl	-4425
ðaðɨ	-4426
▁ˈbɝ	-4427
seki	-4428
ɡje̞	-4429
▁lˈo	-4430
oɾim	-4431
▁har	-4432
iʁ	-4433
▁is	-4434
▁sik	-4435
▁bɪn	-4436
axt	-4437
ʌɪ̯k	-4438
▁mam	-4439
əˌv	-4440
ˈjuz	-4441
n̪oː	-4442
ðus	-4443
mɛ	-4444
äːiː	-4445
aɾɯb	-4446
ivu	-4447
▁ˌæp	-4448
mon	-4449
▁ʃak	-4450
▁ɦʊ	-4451
eːj	-4452
stav	-4453
▁ami	-4454
▁ˈɛt	-4455
ulta	-4456
ili	-4457
ˈamə	-4458
spɛʃ	-4459
ənsi	-4460
▁ke̞	-4461
▁ide	-4462
pos	-4463
eɾas	-4464
▁aka	-4465
ola	-4466
oɾ̪ɯ	-4467
ẽt͡ʃ	-4468
▁pɛɾ	-4469
ɾete	-4470
▁ʋʌ	-4471
tak	-4472
yz	-4473
▁maw	-4474
ejɾu	-4475
ˈfyː	-4476
▁ʔak	-4477
▁mʊ	-4478
kuɾ	-4479
▁rad	-4480
ɛsts	-4481
▁bəd	-4482
▁gu	-4483
˧˧l	-4484
ðukt	-4485
ɕakɯ	-4486
▁ˌu	-4487
ˈota	-4488
ɯme	-4489
iβle	-4490
eɾaɾ	-4491
mad	-4492
ˈɪl	-4493
▁mɔɡ	-4494
ɪkə	-4495
ˈɛd	-4496
emo	-4497
jɛrf	-4498
aɾis	-4499
▁bɛs	-4500
ˌa	-4501
pɛnd	-4502
▁dek	-4503
▁dʑ	-4504
▁dəp	-4505
ʃuz	-4506
ənɪŋ	-4507
stfa	-4508
ˈvɑɫ	-4509
ʋʌɾ̪	-4510
▁avɛ	-4511
͡ʊd	-4512
niha	-4513
▁ˈʃn	-4514
ɾin	-4515
ɔg	-4516
iza	-4517
ɔɲ	-4518
mˈas	-4519
▁ib	-4520
▁ʁes	-4521
ys	-4522
▁wˈ	-4523
▁ˌf	-4524
nət	-4525
▁duɾ	-4526
fekt	-4527
▁dœ̃	-4528
▁ʂɤ	-4529
▁ɛsi	-4530
ʃɝz	-4531
ɨt	-4532
ətɪd	-4533
uˈ	-4534
▁vɛr	-4535
o˧˩˨	-4536
ɛnde	-4537
nɝ	-4538
utʃo	-4539
▁tɯə	-4540
▁ˈsn	-4541
snis	-4542
gaɕ	-4543
tɑ̃	-4544
͡ʊt	-4545
▁ɔk	-4546
βles	-4547
ɛsk	-4548
met	-4549
d͡ʒe	-4550
lʊŋ	-4551
ʎʎo	-4552
ˈoid	-4553
iːb	-4554
▁ˈhɑ	-4555
▁aðe	-4556
ɪlt	-4557
ɾis	-4558
mpre	-4559
kas	-4560
dato	-4561
ɪŋks	-4562
ˈx	-4563
▁go	-4564
▁dɔm	-4565
ɡun	-4566
it˧˧	-4567
ylt	-4568
ˈimp	-4569
ɛɫt	-4570
əˌp	-4571
ɸɯkɯ	-4572
▁dəm	-4573
imos	-4574
▁ɛt	-4575
fe	-4576
▁mˈɪ	-4577
ɡum	-4578
jaɴ	-4579
æps	-4580
▁tə	-4581
ˈaŋi	-4582
t̪ːʌ	-4583
oʊɫz	-4584
ˌat	-4585
▁sɛɾ	-4586
mn	-4587
uːp	-4588
ˈart	-4589
ɪʃt	-4590
vɔl	-4591
ɛt͡s	-4592
▁ˌaf	-4593
▁sˌu	-4594
moɴ	-4595
ɔː	-4596
▁bɯə	-4597
stit	-4598
ikh	-4599
anod	-4600
ʎɐ	-4601
lɐs	-4602
dur	-4603
ɐ̃s	-4604
˨˩˨	-4605
esa	-4606
▁sœl	-4607
ɡin	-4608
ʐɔ	-4609
ɔøən	-4610
əmɝz	-4611
ɡɑɹd	-4612
ɛtst	-4613
ɑɫoʊ	-4614
▁ave	-4615
▁eso	-4616
ɹɔs	-4617
▁mɤ̆	-4618
ɔts	-4619
ˈelə	-4620
▁dɔv	-4621
nolo	-4622
▁ɡdɨ	-4623
ɛla	-4624
gal	-4625
gəb	-4626
▁aˈβ	-4627
ɪtə	-4628
▁ˈaw	-4629
fs	-4630
ʊʃ	-4631
hkan	-4632
▁kaz	-4633
▁aws	-4634
kx	-4635
iːp	-4636
tsˈe	-4637
▁ˈvɝ	-4638
▁ˈfl	-4639
ˌwɝk	-4640
käːɾ	-4641
▁apɾ	-4642
ɾäː	-4643
βaxo	-4644
▁ɛlɐ	-4645
▁tal	-4646
dake	-4647
unik	-4648
▁bəɽ	-4649
▁owt	-4650
▁ɣɯ	-4651
eːp	-4652
▁vɨɾ	-4653
oːr	-4654
st͡ʃ	-4655
n̪t̪	-4656
▁ˈnə	-4657
▁pʁe	-4658
ŋɡw	-4659
ivo	-4660
▁meɾ	-4661
əˌɡ	-4662
▁ˈɛd	-4663
gəˈn	-4664
ɡˈu	-4665
ɪkˈk	-4666
ʃtu	-4667
▁lɔk	-4668
ẽt	-4669
taw	-4670
▁tˈɪ	-4671
zɝ	-4672
tut	-4673
ɔvɨm	-4674
ell	-4675
æʃ	-4676
ɔpoz	-4677
▁ˌən	-4678
ɑɹts	-4679
soto	-4680
att	-4681
▁sof	-4682
alp	-4683
thɯn	-4684
ʂɛj	-4685
iɫɪŋ	-4686
aðoɾ	-4687
a̠ɭʎ	-4688
▁ˈit	-4689
ʒənz	-4690
ɔøə	-4691
ivi	-4692
ʂka	-4693
▁vl	-4694
ˈow	-4695
▁ɾ̪	-4696
ɪtʃu	-4697
ɑtən	-4698
t͡ʃə	-4699
tho̞	-4700
din	-4701
▁bõ	-4702
thɛ̝	-4703
ɪɡˈn	-4704
n̪ɑː	-4705
bur	-4706
ɨsi	-4707
▁inv	-4708
▁ẽkõ	-4709
▁asĩ	-4710
ɕhʌ̹	-4711
▁ɔɡ	-4712
enəs	-4713
jɑ̃	-4714
ɝdʒi	-4715
taðu	-4716
▁ˈæp	-4717
▁lap	-4718
kɔɹd	-4719
ˌweɪ	-4720
ɕmɨ	-4721
ˈip	-4722
▁ʒe	-4723
aɪvz	-4724
▁pək	-4725
ˈuːs	-4726
iðu	-4727
stra	-4728
ənəɫ	-4729
iɯk	-4730
ɾia	-4731
▁koj	-4732
▁ˈah	-4733
▁som	-4734
ʒin	-4735
ɦʌ̹m	-4736
▁n̪ɐ	-4737
ɛɾts	-4738
▁bəz	-4739
ˈfɔɹ	-4740
▁pow	-4741
▁uʐɨ	-4742
ˈonə	-4743
ɲɲo	-4744
æθ	-4745
baɴ	-4746
dər	-4747
ɹɔŋ	-4748
arjo	-4749
▁vr	-4750
bas	-4751
kt̪	-4752
əðɝ	-4753
bˈo	-4754
tes	-4755
▁fel	-4756
təm	-4757
▁buk	-4758
lˈɛ	-4759
oɐs	-4760
▁ið	-4761
▁abɨ	-4762
ɔdɥi	-4763
ɔkɪŋ	-4764
ɨɻ	-4765
ˈatə	-4766
▁pak	-4767
dɯɾi	-4768
mete	-4769
ˌɹ	-4770
mph	-4771
▁ʃoz	-4772
tuɾ	-4773
ˈeːk	-4774
▁kli	-4775
js	-4776
ntak	-4777
▁tɔ̃	-4778
veːn	-4779
bˈe	-4780
fəɫi	-4781
iɾjo	-4782
▁ins	-4783
▁prˌ	-4784
▁ˈɛl	-4785
▁hɪˈ	-4786
it̪	-4787
▁căŋ	-4788
pˌ	-4789
zis	-4790
ɪŋs	-4791
▁bəs	-4792
▁jeː	-4793
ˈɛo	-4794
fat	-4795
kəɾ	-4796
naɴ	-4797
kˈi	-4798
ˈeɪd	-4799
fˈe	-4800
nat	-4801
uvd	-4802
baj	-4803
sɯɯ	-4804
id͡ʑ	-4805
aha	-4806
aːnd	-4807
əmˌt	-4808
▁ra	-4809
uːz	-4810
hˈa	-4811
ˈɪɡə	-4812
▁ɪˈf	-4813
ɡər	-4814
▁due	-4815
▁nˈo	-4816
iss	-4817
t͡ʃo	-4818
▁fɔ̃	-4819
▁kre	-4820
omp	-4821
stik	-4822
əm˧˧	-4823
ɾeː	-4824
siɾ	-4825
▁ro	-4826
ɔt͡s	-4827
ɹeɪ	-4828
▁sju	-4829
ɛmɨ	-4830
ɳeːn	-4831
dul	-4832
ɛste	-4833
ɫaɪ	-4834
e̞sh	-4835
▁ɐn	-4836
ʁik	-4837
ɛss	-4838
▁ʔap	-4839
ɛt͡	-4840
ˈər	-4841
▁sap	-4842
takɯ	-4843
laˈ	-4844
ɾɛ̝	-4845
ʈiː	-4846
daɾ	-4847
▁ˈta	-4848
▁ri	-4849
oton	-4850
aʊns	-4851
ɔbɨ	-4852
ɛɡul	-4853
əzən	-4854
imɐ	-4855
ˈɪst	-4856
▁ɔps	-4857
e̞n	-4858
opt	-4859
kət	-4860
▁pɛv	-4861
▁rˈo	-4862
sten	-4863
▁pɹˌ	-4864
ˈoɡa	-4865
ɑmən	-4866
ˈvi	-4867
▁iəw	-4868
▁did	-4869
βjeɾ	-4870
zam	-4871
o˧ˀ˥	-4872
ɑɹti	-4873
▁app	-4874
onos	-4875
bˌ	-4876
ɛsz	-4877
ˈfɔl	-4878
▁ˈɛr	-4879
ba̠ŋ	-4880
ˈalə	-4881
▁nad	-4882
ɐ̃sɐ	-4883
▁kin	-4884
▁ʋeː	-4885
▁mɲɛ	-4886
ẽtʃ	-4887
alkj	-4888
▁pwɔ	-4889
ˈtʃ	-4890
erk	-4891
ət͡ʃ	-4892
aɪ̯m	-4893
ʂɔ̃	-4894
ʈeː	-4895
▁ly	-4896
▁ʁəl	-4897
toiɯ	-4898
elo	-4899
▁fiz	-4900
enai	-4901
aːɾ	-4902
atə	-4903
əmi	-4904
ndz	-4905
▁ɾi	-4906
▁sia	-4907
▁ed	-4908
ʈːɯ	-4909
idɪd	-4910
adɨ	-4911
les	-4912
▁taɾ	-4913
ɨʋ	-4914
▁ɛsɐ	-4915
ɑkt	-4916
ɾɯno	-4917
▁pʁi	-4918
weɾ	-4919
amɑ̃	-4920
▁lɛ̃	-4921
aɾse	-4922
ɪçts	-4923
nɪŋ	-4924
mo̞	-4925
▁ane	-4926
ɐjɾu	-4927
▁tfɔ	-4928
͡ɪd	-4929
juʃ	-4930
xɔ	-4931
ɕɲɛ	-4932
stɔ	-4933
alzo	-4934
ɑːna	-4935
ænət	-4936
kɨ	-4937
aɪɝz	-4938
▁ciw	-4939
aっt	-4940
ˈɛp	-4941
ɔʒ	-4942
ajɛ	-4943
▁aːn	-4944
zəɫt	-4945
tokɯ	-4946
ŋɡeː	-4947
▁ˈɑf	-4948
▁fak	-4949
ɾei	-4950
ɰβaɾ	-4951
▁all	-4952
▁kõp	-4953
▁sub	-4954
sɛj	-4955
iːde	-4956
alə	-4957
ŋah	-4958
kwa	-4959
▁gaʁ	-4960
ɲiz	-4961
iðas	-4962
dɛ	-4963
təmz	-4964
ɹz	-4965
ɕit͡	-4966
ə˧˨	-4967
hi	-4968
ˈima	-4969
tʁe	-4970
▁pɔɕ	-4971
▁dəv	-4972
ntɾ	-4973
▁tuʁ	-4974
ahas	-4975
naɾi	-4976
ʎas	-4977
ɪʋ	-4978
unɯn	-4979
aɾba	-4980
ɡʌ̹n	-4981
peʁ	-4982
ɹɪk	-4983
ɨʃt	-4984
oks	-4985
ɡɔd	-4986
▁aff	-4987
beɾ	-4988
▁ʂw	-4989
ŋka	-4990
▁jˌe	-4991
oke	-4992
▁ur	-4993
